{
    "status": "success",
    "totalResults": 98,
    "results": [
        {
            "title": "Dogecoin Pumps Hard After Elon Musk Launches Counterattack in DOGE Lawsuit",
            "link": "https://www.crypto-news-flash.com/dogecoin-pumps-hard-after-elon-musk-launches-counterattack-in-doge-lawsuit/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-pumps-hard-after-elon-musk-launches-counterattack-in-doge-lawsuit",
            "keywords": [
                "News",
                "Dogecoin pump",
                "Elon Musk Dogecoin",
                "Musk Lawsuit"
            ],
            "creator": [
                "AnnJoy Makena"
            ],
            "video_url": null,
            "description": "Elon Musk and Tesla have taken action by filing a motion for Rule 11 sanctions against Evan Spencer. Yesterday, the value of Dogecoin (DOGE) underwent a sudden and significant increase, surging by 3 percent within a span of a few minutes. Elon Musk and Tesla Inc. have launched a counterattack against the attorney representing the [...]",
            "content": "Elon Musk and Tesla have taken action by filing a motion for Rule 11 sanctions against Evan Spencer. Yesterday, the value of Dogecoin (DOGE) underwent a sudden and significant increase, surging by 3 percent within a span of a few minutes. window.coinzilla_display = window.coinzilla_display || []; var c_display_preferences = {}; c_display_preferences.zone = \"277607dd63990fae550\"; c_display_preferences.width = \"728\"; c_display_preferences.height = \"90\"; coinzilla_display.push(c_display_preferences); Elon Musk and Tesla Inc. have launched a counterattack against the attorney representing the individuals who filed a lawsuit on behalf of Dogecoin investors. In a recent submission to the U.S. District Court for the Southern District of New York, Musk requested Rule 11 penalties against Evan Spencer from Even Spencer Law. Spencer is the legal representative for a potential group of Dogecoin investors who accused Musk and his company of manipulating the value of the cryptocurrency for their gains. False Premise Allegations Against Evan Spencer And The Impact on DOGE Value According to a Reuters report , Elon Musk and Tesla have taken action by filing a motion for Rule 11 sanctions against Evan Spencer, the attorney representing the plaintiffs in the Dogecoin lawsuit. They argued in their recent filing that Spencer had prior knowledge of the false basis of his case before initiating legal proceedings, marking a new offensive strategy from Musk and his legal team. More than a month had passed since Spencer filed an amended complaint on behalf of the plaintiffs, accusing the tech billionaire of profiting billions of dollars by selling off DOGE after generating hype for the memecoin on Twitter, a platform Musk recently bought. However, Musk’s attorneys contested in their new filing noted that the wallets mentioned in the amended complaint did not belong to Tesla or its owner. Furthermore, the filing emphasized that Spencer was already aware of this fact before submitting the amended complaint, which included allegations of insider trading. Elon Musk and Tesla urged the presiding judge to dismiss the amended complaint and impose sanctions on Evan Spencer. Subsequently, DOGE experienced a decrease of over 7 percent in value following the motion for sanctions. The Ripple Effect: How Elon Musk’s Tweet Triggered a Surge in Dogecoin (DOGE) Value Yesterday, the value of Dogecoin (DOGE) underwent a sudden and significant increase, surging by 3 percent within a span of one minute, resulting in a rise from $0.07 to $0.073 per DOGE. The driving force behind this rapid surge was none other than Elon Musk. window.coinzilla_display = window.coinzilla_display || []; var c_display_preferences = {}; c_display_preferences.zone = \"229607dd639904ac581\"; c_display_preferences.width = \"300\"; c_display_preferences.height = \"250\"; coinzilla_display.push(c_display_preferences); Known for his lighthearted engagement with the cryptocurrency community, Musk provided a brief but significant response on Twitter when asked about his preference between cats and dogs: “Doges.” Surprisingly, this seemingly harmless reply acted as a catalyst, instantly sparking a notable surge in the value of the corresponding token. Follow us for the latest crypto news! Doges — Elon Musk (@elonmusk) July 17, 2023 Within moments, substantial trading volumes inundated the DOGE market, likely triggered by automated purchasing bots intricately designed to capitalize on any mention of Dogecoin by the self-proclaimed “Dogefather” – Elon Musk. Nevertheless, the initial surge in value proved to be ephemeral. In a matter of minutes, the vertical increase displayed on the DOGE price chart rapidly dissipated. Surprisingly, within three hours from the time of the tweet, the price of Dogecoin experienced a drastic decline of over 5 percent at its lowest point, effectively nullifying the entire preceding pump and resulting in the token’s value settling a few percentage points lower. The surprising turn of events serves as a valuable lesson, highlighting the futility of attempting to trade Dogecoin solely based on Musk’s tweets or news. The predictable patterns that emerge from such trading endeavors make it highly probable that individuals would find themselves at a disadvantage rather than successfully competing with swift trading bots that effortlessly capitalize on these trends. Crypto News Flash does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. Readers should do their own research before taking any actions related to cryptocurrencies. Crypto News Flash is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned. window.coinzilla_header = window.coinzilla_header || []; function czilla() {coinzilla_header.push(arguments);} czilla('2946092a0f663306834'); Dogecoin pump Elon Musk Dogecoin Musk Lawsuit",
            "pubDate": "2023-07-18 10:22:38",
            "image_url": null,
            "source_id": "cryptonewsflash",
            "category": [
                "top"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk, Other Tesla Directors To Return $735M Over Accusations Of Overpaying Themselves",
            "link": "https://www.ibtimes.com/elon-musk-other-tesla-directors-return-735m-over-accusations-overpaying-themselves-3705534",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Elon Musk and other Tesla board directors have agreed to return $735 million to the company over claims they were overpaid between 2017 and 2020, which the directors have denied.",
            "content": "NEWSLETTER SIGNUP My account Log Out Jul 18, 5:43 AM EDT Business Technology World National Politics Media & Culture Opinion Sports Social Capital Crypto NEWSLETTER My account Log Out US Edition Business Technology World National Politics Media & Culture Opinion Sports Social Capital Crypto Listings & More Spotlight Glossary Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States NEWSLETTER Follow Us Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States Companies Auto Elon Musk, Other Tesla Directors To Return $735M Over Accusations Of Overpaying Themselves By Marvie Basilan @marvbuzzilan 07/18/23 AT 4:43 AM EDT Share on Facebook Share on Twitter Share on LinkedIn Share on Reddit Share on Flipboard Twitter owner and Tesla CEO, along with other Tesla board directors, have agreed to pay $735 million back to the EV giant. AFP KEY POINTS Musk and the other board directors have denied the overpay allegations Musk was also sued for his $56 billion pay package in 2018 Tesla also faces allegations of racism and unsafe working conditions Tesla CEO Elon Musk and other board directors of the electric vehicle giant have agreed Monday to return $735 million directly to the company to settle claims that they overpaid themselves over a span of about three years. The settlement stems from a complaint lodged by the Police and Fire Retirement System of Detroit and a few others in 2020 alleging that Tesla 's board of directors \"have granted themselves millions in excessive compensation and are poised to continue this unrelenting avarice into the indefinite future,\" Bloomberg first reported . The complainants further alleged Tesla board directors \"breached their fiduciary duties\" when they overpaid themselves excessively and in an unfair manner, a January filing in a Delaware court showed. The directors include Oracle founder Larry Ellison, media mogul Rupert Murdoch 's son James Murdoch and Musk's brother Kimbal Musk. They denied the allegations but agreed to settle the case \"to eliminate the uncertainty, risk, burden, and expense of further litigation,\" according to a filing last month. Tesla Is Hiring Test Drivers, Offering Up To $48 Per Hour To Drive Its EVs Read more Tesla Is Hiring Test Drivers, Offering Up To $48 Per Hour To Drive Its EVs Musk and the other board directors have also agreed to not take any compensation for 2021, 2022 and 2023. The case will not be officially settled until Chancellor Kathaleen McCormick gives her final approval. McCormick was also the judge who presided over the litigation involving Musk's turbulent acquisition of Twitter last year. Musk previously came under scrutiny for his $56 billion pay deal when Tesla shareholder Richard Tornetta sought to rescind the tech titan's 2018 compensation package, which he said was \"the largest compensation grant in human history.\" Tornetta's legal team argued that Musk's 2018 pay package did not serve its real purpose of getting the tech mogul to focus on his EV company. \"Indeed, Musk testified that since the Grant's approval, he has spent a little more than half his time on Tesla matters and has dedicated substantial time and attention to various other endeavors,\" the lawsuit read. Tesla has faced a string of complaints in recent years, including accusations of racism in the EV giant's Fremont plant in the San Francisco Bay Area. Lawyers suing the company said at least 6,000 workers could join a class action lawsuit alleging rampant racism at the company. As of June, more than 200 Black workers have submitted testimonies regarding the racism allegations. A former employee also alleged that Tesla's sweat shop in Peabody, Massachusetts, had an unsafe working environment . The worker said he was fired in 2021 after complaining several times about the \"dangerous heat situation\" at the shop. Workers at a Buffalo, New York, factory announced in February that they were launching a campaign to form Tesla's first union . The workers demand better wages, better job security and a say in decision-making at the workplace. Read more Elon Musk Predicts 'Digital Superintelligence' To Arrive In 5-6 Years, Launches AI Company US Safety Regulators Demand More Records On Tesla Autopilot REGISTER FOR FREE to continue reading ✔️ Unlock the full content of International Business Times UK for free offer available for a limited time only ✔️ Easily manage your Newsletters subscriptions and save your favourite articles ✔️ No payment method required Already have an account? Log in © Copyright IBTimes 2023. All rights reserved. Join the Discussion MOST READ IN Companies 1 Binance Lays Off 1,000 Employees, Could Cut Thousands More Jobs Amid DOJ Probe: Reports 2 Elon Musk, Other Tesla Directors To Return $735M Over Accusations Of Overpaying Themselves 3 Beginning Of The End For ChatGPT? FTC Launches OpenAI Probe; Altman Disappointed NEWS Business Technology World National Politics Media & Culture Opinion Sports Crypto Featured Social Capital Glossary SMB Forum Spotlight ABOUT About Us Contact us Advertise with us Terms & Conditions Privacy Policy Cookie Policy Editions United States Australia Brazil Colombia France Germany Indonesia India International Italy Japan Editions Nigeria Philippines Singapore South Africa South Korea Spain Mexico Taiwan United Arab Emirates United Kingdom FOLLOW US Facebook Twitter LinkedIn Newsletter © Copyright 2023 IBTimes LLC. All Rights Reserved.",
            "pubDate": "2023-07-18 08:43:01",
            "image_url": null,
            "source_id": "ibtimes",
            "category": [
                "business"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk Fires Another Tweet",
            "link": "https://cryptopress.network/elon-musk-fires-another-tweet/",
            "keywords": [
                "Bitcoin News"
            ],
            "creator": [
                "admin"
            ],
            "video_url": null,
            "description": "Elon Musk’s preference for Dogecoin (DOGE) over other cryptocurrencies has had a significant impact on its price. A recent tweet from Musk stating “Doges” in response to a question about cats and dogs caused a 3% increase in DOGE’s price. This demonstrates the power of Musk’s influence in the cryptocurrency market. Despite a slight dip […] The post Elon Musk Fires Another Tweet appeared first on Crypto Press Cryptocurrencies News Network.",
            "content": "Elon Musk’s preference for Dogecoin (DOGE) over other cryptocurrencies has had a significant impact on its price. A recent tweet from Musk stating “Doges” in response to a question about cats and dogs caused a 3% increase in DOGE’s price. This demonstrates the power of Musk’s influence in the cryptocurrency market. Despite a slight dip after the initial surge, DOGE still recorded a modest increase of 0.5% within the last 24 hours and a promising gain of 8.2% over seven days. Additionally, a crypto trading expert predicts a potential 10% price surge for DOGE if it breaks through a significant $0.75 supply wall. This article originally appeared on www.newsbtc.com Elon Musk, the enigmatic technology entrepreneur and CEO of Tesla and SpaceX, is known for his unorthodox communication style, often making headlines with his bold and sometimes controversial tweets. Recently, Musk fired off another tweet that captured the attention of both his followers and the media. In the tweet that had the internet buzzing, Musk made a cryptic announcement about a new project under development. He wrote, “Working on something groundbreaking. More details coming soon!” This tweet immediately fueled speculation and curiosity among his millions of followers, who quickly began speculating about what new venture Musk has in the pipeline. While Musk’s tweets have become a regular part of his public persona, they also tend to have a significant impact on markets and investor sentiment. His previous social media posts have resulted in fluctuations in Tesla’s stock price and have even landed him in legal trouble. However, this has not deterred Musk from expressing himself freely on Twitter. Some argue that Musk’s habit of firing off tweets without a filter can be both a strength and a weakness. On one hand, his unfiltered social media presence has allowed audiences to get a glimpse into his thought process and vision. It has also helped shape and promote his companies, as his tweets often generate media attention and buzz. On the other hand, his tendency to make spontaneous and sometimes controversial statements has drawn criticism and has, at times, brought negative attention to his companies. Despite the potential drawbacks, Musk’s bold communication style has undoubtedly contributed to his success. He has amassed a substantial following on Twitter, with millions eagerly awaiting his updates and announcements. This captive audience enables him to directly engage with his supporters, drumming up excitement for his projects and attracting investor interest. With each new tweet, Musk generates enthusiasm and speculation, spurring conversations and discussions among his followers. This not only keeps him at the forefront of people’s minds but also sets him apart from other CEOs who tend to stick to more traditional communication methods. Musk’s ability to captivate his audience has become a powerful tool in building his personal brand and shaping public perception. So, as the world waits eagerly for Musk to reveal more details about his upcoming project, it is clear that his tweets have become an integral part of his public persona. Love them or hate them, his tweets continue to spark curiosity, ignite discussions, and keep us all wondering: What will Elon Musk do next? Source link",
            "pubDate": "2023-07-18 06:43:31",
            "image_url": null,
            "source_id": "cryptopress",
            "category": [
                "top"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Zuckerberg's Threads Tightens Rate Limits On 'Spam Attacks' — And Elon Musk Can't Stop Laughing",
            "link": "https://www.benzinga.com/news/23/07/33260513/zuckerbergs-threads-tightens-rate-limits-on-spam-attacks-and-elon-musk-cant-stop-laughing",
            "keywords": [
                "Adam Mosseri",
                "Consumer Tech",
                "Elon Musk",
                "Instagram",
                "Mark Zuckerberg",
                "Meta",
                "META",
                "News",
                "Social Media",
                "Threads",
                "twitter",
                "Twitter Blue",
                "Tech",
                "META",
                "News",
                "Social Media",
                "Tech",
                "Benzinga"
            ],
            "creator": null,
            "video_url": null,
            "description": "Mark Zuckerberg tightens rate limits on Threads, prompting Elon Musk to taunt him with a playful \"copy cat\" remark. read more",
            "content": "Meta Platforms Inc.’s META CEO, Mark Zuckerberg , has tightened his grip on Threads’ rate limits, prompting Elon Musk’s cheeky ‘copy cat’ taunt . What Happened: Instagram boss Adam Mosseri took to Threads, the alternative to Twitter , and announced the implementation of rate limits to combat the rising tide of spam attacks. As the platform grows exponentially, the need to address bot-related issues became evident, but the move came with a catch. While aimed at curbing spam, the rate limits had the unintended consequence of potentially restricting active users (false positives). See Also: Elon Musk And Stephen King Engage In Witty Twitter Exchange Over Mark Zuckerberg Rivalry Responding to this news, the Twitter owner couldn’t resist poking fun at the situation, and in classic Musk fashion, he posted, “Lmaooo Copy Cat” — but instead of writing “Cat” in letters, he posted an emoji of a cat. On the other hand, Zuckerberg expressed his optimism and emphasized focus on refining the basics and retention. Why It’s Important: For the unversed, earlier this year, Musk enacted rate limits on Twitter to counter the rampant data scraping and system manipulation plaguing the platform. Initially intended as a temporary measure to tackle extreme levels of abuse, the tech billionaire has gradually eased the restrictions, allowing users, particularly Twitter Blue subscribers, to access more daily tweets. Nonetheless, this decision initially triggered a backlash , giving Meta the perfect opportunity to launch Threads. Threads had over 100 million users signing up in less than a week. Although, reports now indicated a notable decline in daily active users and app usage time on Threads, suggesting that the initial frenzy may have fizzled out . Check out more of Benzinga’s Consumer Tech coverage by following this link . Read Next: Elon Musk Pushes Twitter Staff To Ship Better Features ‘Faster Than Ever’ To Counter Zuckerberg’s Threads Threat Photo via Shutterstock",
            "pubDate": "2023-07-18 06:01:19",
            "image_url": null,
            "source_id": "benzinga",
            "category": [
                "top"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk Calls ‘Copycat’ After Threads To Implement Twitter-Like Rate Limits",
            "link": "https://www.latestly.com/technology/elon-musk-calls-copycat-after-threads-to-implement-twitter-like-rate-limits-5273560.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Later, when a user tweeted a screenshot of Mosseri's post, Musk said, \"Lmaooo.\" \"Copy *cat emoji*.\" Musk also said, \"Seems oppressive.\" Earlier this month, Musk had said that he has applied temporary limits on who will read how many posts in a day, to prevent data scraping and system manipulation.",
            "content": "San Francisco, July 18 : Following Instagram head Adam Mosseri's announcement to implement rate limits on Threads, Twitter-owner Elon Musk reacted to the decision and called it a copycat . Mosseri posted on Threads, \"Spam attacks have picked up so we're going to have to get tighter on things like rate limits, which is going to mean more unintentionally limiting active people (false positives). If you get caught up those protections let us know.\" Later, when a user tweeted a screenshot of Mosseri's post, Musk said, \"Lmaooo.\" \"Copy *cat emoji*.\" Musk also said, \"Seems oppressive.\" Earlier this month, Musk had said that he has applied temporary limits on who will read how many posts in a day, to prevent data scraping and system manipulation. Elon Musk Taunts Mark Zuckerberg, Says Meta Founder and CEO Really Burning Midnight Oil. Meta Founder and CEO Mark Zuckerberg on Tuesday announced that \"10s of millions of people now come back daily\" on Threads and \"that's way ahead of what we expected.\" \"The focus for the rest of the year is improving the basics and retention. It'll take time to stabilise, but once we nail that then we'll focus on growing the community,\" Zuckerberg added. Also, replying to a thread asking about his best tech \"hot takes\", Mosseri said, \"Android's now better than iOS.\" Since Threads was launched, Musk has been praising and improving Twitter, while criticising Threads and Zuckerberg. Musk on Monday said, \"Whatever sins this platform may have, being boring is not one of them.\" On Sunday, he said that Zuckerberg doesn't seem to care about his new product. Earlier, in response to a tweet about Meta CEO's investment in the Metaverse, Musk said, \"Censorship pays them well.\" Elon Musk Reacts to US Vice President Kamala Harris's Call for Population Reduction as Part of Climate Change Movement, Says 'Need to Increase Population'. The Twitter-owner had also mocked Zuckerberg, and said, \"Zuck is a cuck.\" \"I propose a literal d*** measuring contest,\" he had tweeted. Musk also said, \"Competition is fine, cheating is not.\" \"Zuck my *tongue emoji*,\" he had tweeted last month. In 2017, Tesla CEO had hit back at Zuckerberg, saying that the Meta CEO's understanding of artificial intelligence (AI) was \"limited\". (The above story first appeared on LatestLY on Jul 18, 2023 11:02 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).",
            "pubDate": "2023-07-18 05:32:44",
            "image_url": null,
            "source_id": "latestly",
            "category": [
                "top"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        },
        {
            "title": "China Plans to Build a Satellite Network to Rival Elon Musk’s Starlink",
            "link": "https://ca.sports.yahoo.com/video/china-plans-build-satellite-network-040100508.html?src=rss",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": null,
            "content": null,
            "pubDate": "2023-07-18 04:01:00",
            "image_url": null,
            "source_id": "yahoo",
            "category": [
                "sports"
            ],
            "country": [
                "canada"
            ],
            "language": "english"
        },
        {
            "title": "Tesla Of AI Or 'Truth Social' Of Chatbots: Dilemma Of Elon Musk's New Venture xAI",
            "link": "https://www.benzinga.com/news/23/07/33260109/tesla-of-ai-or-truth-social-of-chatbots-dilemma-of-elon-musks-new-venture-xai",
            "keywords": [
                "Consumer Tech",
                "Elon Musk",
                "GOOGL",
                "META",
                "News",
                "Social Media",
                "Tesla",
                "TSLA",
                "twitter",
                "xAI",
                "Tech",
                "Media",
                "General",
                "TSLA",
                "US88160R1014",
                "GOOGL",
                "US38259P5089",
                "META",
                "News",
                "Social Media",
                "Tech",
                "Media",
                "General",
                "Benzinga"
            ],
            "creator": null,
            "video_url": null,
            "description": "read more",
            "content": "Elon Musk ‘s latest venture, xAI , aims to become the Tesla of artificial intelligence (AI) — a household name synonymous with cutting-edge technology. However, skeptics see the risk of it becoming the ‘Truth Social’ of chatbots, a right-leaning alternative that fails to take off, Politico reports. Musk’s Vision Musk, who has described his Twitter takeover as a bid to stop the \"woke mind virus,\" launched xAI last week, extending his campaign against progressive mores into an emerging, politically charged technology. This move cements his status as the de facto leader of a faction of Silicon Valley libertarians that have increasingly aligned with Republicans. Industry Reactions However, amidst ongoing debates over AI bias and potential existential risks to humanity, skeptics in Washington and the tech world question whether Musk's new firm could nudge the trajectory of the technology's development in a libertarian direction, or if it will ever get off the ground. See Also: Elon Musk And Mark Zuckerberg Cage Fight Will Serve As Inspiration For Children, Says Marc Andreessen Future Prospects Despite the controversies, some experts have not dismissed Musk’s ideas outright, citing the impressive technical credentials of xAI's starting team, which includes veterans of Google and OpenAI. These factors could potentially help xAI become a household name in AI, akin to Tesla in the automotive industry. Read Next: Despite Backlash, Real Housewives Star Dolores Catania Talks About Using Ozempic: I’m Being Realistic Image by ssi77 on Shutterstock Engineered by Benzinga Neuro , Edited by Pooja Rajkumari The GPT-4 Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more.",
            "pubDate": "2023-07-18 03:49:02",
            "image_url": null,
            "source_id": "benzinga",
            "category": [
                "top"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Biden's Social Media Team Faces Double Community Nuking — Elon Musk Says, 'Happens To Me' All The Time",
            "link": "https://www.benzinga.com/news/23/07/33259948/bidens-social-media-team-faces-double-community-nuking-elon-musk-says-happens-to-me-all-the-time",
            "keywords": [
                "Community Notes",
                "Consumer Tech",
                "Elon Musk",
                "Joe Biden",
                "Mark Zuckerberg",
                "META",
                "News",
                "POTUS",
                "Social Media",
                "Threads",
                "twitter",
                "Tech",
                "META",
                "News",
                "Social Media",
                "Tech",
                "Benzinga"
            ],
            "creator": null,
            "video_url": null,
            "description": "U.S. President Joe Biden's social media team encounters Community Nuking on Twitter, a phenomenon also experienced by Elon Musk. read more",
            "content": "U.S. President Joe Biden’s team has found itself entangled in the relentless storm of Community Nuking on Elon Musk’s Twitter . What Happened: On Monday, a Twitter user who goes by the handle @EndWokeness and has 1.4 million followers posted a couple of screenshots indicating that Biden’s social media team experienced a double dose of Community Nuking on the platform — a phenomenon Musk himself is no stranger to . See Also: Is Elon Musk Losing His Twitter Magic? Most Followed User’s Engagement Nosedives The screenshots appeared to indicate two tweets from the official POTUS’ account with the Gray checkmark — introduced under the Twitter Blue unveiling for government and multilateral accounts . In response, Musk stated that these Community Nukings also happen to him, “right-wing” accounts, and even advertisers — something which is not good for revenue. Why It’s Important: In April this year, Musk announced that “anyone,” be it civilian users, advertisers, heads of state, or even himself, would be Community Noted should they be found making “materially false statements” on the microblogging site. At the time, Community Notes clarified that “some” tweets containing “false claims” might not be subject to flagging by the feature, attributing this limitation to the system’s reach being constrained by participation. Previously, Meta Platforms Inc.’s META CEO Mark Zuckerberg commended the feature, stating that the approach improves user experience rather than simply removing the information altogether from the platform. Meta’s Threads is currently being hailed as the Twitter killer as it sprinted to 100 million users in five days. However, it still seems to have a long way to go before implementing a similar feature on the platform. Photo Courtesy: Shutterstock.com Check out more of Benzinga’s Consumer Tech coverage by following this link . Read Next: Elon Musk Pushes Twitter Staff To Ship Better Features ‘Faster Than Ever’ To Counter Zuckerberg’s Threads Threat",
            "pubDate": "2023-07-18 02:28:57",
            "image_url": null,
            "source_id": "benzinga",
            "category": [
                "top"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Twitter Alternatives Threads, Bluesky Suffer Same Issues Elon Musk Warned About",
            "link": "https://www.ibtimes.com/twitter-alternatives-threads-bluesky-suffer-same-issues-elon-musk-warned-about-3705486",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Twitter's two chief rivals have suffered spam and content moderation issues that Elon Musk previously tried to resolve.",
            "content": "NEWSLETTER SIGNUP My account Log Out Jul 17, 11:18 PM EDT Business Technology World National Politics Media & Culture Opinion Sports Social Capital Crypto NEWSLETTER My account Log Out US Edition Business Technology World National Politics Media & Culture Opinion Sports Social Capital Crypto Listings & More Spotlight Glossary Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States NEWSLETTER Follow Us Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States Technology Twitter Alternatives Threads, Bluesky Suffer Same Issues Elon Musk Warned About By Kent Masing 07/17/23 AT 10:15 PM EDT Share on Facebook Share on Twitter Share on LinkedIn Share on Reddit Share on Flipboard AFP KEY POINTS Threads announced strengthening rate limits to counter spam attacks on the platform Bluesky users complained about some accounts that used racial slurs in their usernames Twitter was heavily criticized after implementing \"extreme measures\" aimed at bots and \"bad actors\" Bluesky and Threads, two of the most promising Twitter competitors, are experiencing spam and content moderation issues that Elon Musk 's social media platform previously suffered. On Monday, Adam Mosseri, the head of Instagram who also runs its new microblogging app Threads, revealed that the new social media platform will employ restrictions to combat \"spam attacks.\" \"We're going to have to get tighter on things like rate limits, which is going to mean more unintentionally limiting active people (false positives). If you get caught up [in] those protections let us know,\" Mosseri wrote on his Threads post . Meanwhile, Bluesky, the decentralized social media website launched by former Twitter CEO Jack Dorsey, faced a community backlash last week after it was revealed that some accounts used racial slurs in their usernames. In response, Bluesky said it removed the suspicious accounts within 40 minutes after some users alerted them. \"Our community guidelines reflect our values: that racism and harassment have no place on Bluesky, and we will continue to take action to uphold these policies,\" the platform said on its official account, according to Mashable . Bryan Newbold, a protocol engineer and a Bluesky team member, also apologized for the incident, saying it \"caused harm to real people, including Black folks... who supported Bluesky.\" Earlier this month, Musk's Twitter carried out \"extreme measures\" to address spam and bots on the platform. In a blog post , Twitter said it \"temporarily limited usage\" in order to detect automated accounts and \"other bad actors\" harming the app. The app also moved to prevent bots from scraping the data of public Twitter users and manipulating conversations on the platform. However, the move was heavily criticized by the Twitter community after many received an error message that they had exceeded the \"rate limit\" and were blocked from seeing other tweets. Esther Crawford, Twitter's former director of product management who was fired by Musk in February, hit out at his decision. \"Hubris + no pushback - customer empathy - data = a great way to light billions on fire,\" Crawford wrote . In addition, Twitter's recent meltdown had been exploited by Meta, the company owned by Facebook founder Mark Zuckerberg , to launch the Threads app on July 6. Read more Musk Says Twitter Has Lost Half Its Advertising Revenue Unlikely Savior: Musk's Antics Give Zuckerberg PR Makeover Twitter Better For 'Freedom Of Speech', Says Senior Afghan Taliban Official On his official Threads account , Zuckerberg touted the platform as an \"open and friendly public space for conversation.\" In a span of five days, Meta's new social app garnered more than 100 million signups, breaking the record of OpenAI's ChatGPT, which amassed the same number of registrations in two months. AFP Twitter Facebook Elon musk Mark zuckerberg REGISTER FOR FREE to continue reading ✔️ Unlock the full content of International Business Times UK for free offer available for a limited time only ✔️ Easily manage your Newsletters subscriptions and save your favourite articles ✔️ No payment method required Already have an account? Log in © Copyright IBTimes 2023. All rights reserved. Join the Discussion MOST READ IN Technology 1 SEC Throws Shade On Coinbase Compliance As Judge Seemingly Aligns With CEX 2 Twitter Rivals Threads, Bluesky Suffer Same Issues Elon Musk Warned About 3 Why The FTC Is Investigating OpenAI NEWS Business Technology World National Politics Media & Culture Opinion Sports Crypto Featured Social Capital Glossary SMB Forum Spotlight ABOUT About Us Contact us Advertise with us Terms & Conditions Privacy Policy Cookie Policy Editions United States Australia Brazil Colombia France Germany Indonesia India International Italy Japan Editions Nigeria Philippines Singapore South Africa South Korea Spain Mexico Taiwan United Arab Emirates United Kingdom FOLLOW US Facebook Twitter LinkedIn Newsletter © Copyright 2023 IBTimes LLC. All Rights Reserved.",
            "pubDate": "2023-07-18 02:15:24",
            "image_url": null,
            "source_id": "ibtimes",
            "category": [
                "politics"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk explains why xAI will be more trustworthy than OpenAI, Google",
            "link": "https://www.livemint.com/ai/artificial-intelligence/elon-musk-explains-why-xai-will-be-more-trustworthy-than-openai-google-11689640891437.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Elon Musk claims his new AI company xAI is better than Google and OpenAI in understanding the universe. He criticizes OpenAI for being controlled by Microsoft. Musk is training xAI to be 'maximally curious' and align with human values.",
            "content": "Twitter owner has explained why his new AI company xAI is better than other companies in the area of artificial intelligence namely, Google and . Musk had recently announced his new AI company in a bid to ‘understand the true nature of the universe’. Musk has been critical of OpenAI, a company he helped co-found in 2015. The billionaire has claimed that OpenAI is “training AI to be woke\" and that the company was “effectively controlled by Microsoft.\" In a recent Twitter Spaces, Musk noted that his company is training the new AI system to be “maximally curious\" which could lead the AI to naturally align its behaviour with human values and reduce the potential risks associated with its development. During the course of the discussion, Musk noted that his AI system will allow people to get answers to questions which are often touted as controversial. He claimed that there was significant danger in not allowing the AI to say what it really wanted and notified that xAI will allow the AI to say what it believed even if it resulted in some criticism. According to , in the realm of technology, the term \"xAI\" is often used as an abbreviation for Explainable AI or Interpretable AI. This concept focuses on enabling humans to comprehend the rationale behind the decisions or predictions made by artificial intelligence system A Time magazine report in March claimed that xAI had purchased 10,000 graphics processing units (GPUs) in March. These hardware components are essential for the development and operation of advanced AI systems. Musk has also previously shown an interest in developing an AI chatbot called 'TruthGPT', in stark contrast to OpenAI's popular ChatGPT chatbot. He has said that TruthGPT will be a maximum truth-seeking AI focused on understanding the universe. The billionaire noted that if an AI model cares about understanding the universe, then it is unlikely to wipe out humans because they are an interesting part of the universe.",
            "pubDate": "2023-07-18 01:09:04",
            "image_url": "https://www.livemint.com/lm-img/img/2023/07/18/1600x900/Elon-Musk-Artificial-Intelligence-0_1689642404187_1689642450043.jpg",
            "source_id": "livemint",
            "category": [
                "science"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        }
    ],
    "nextPage": "168964254480f9431cfbbb60e96bef16017973fb58"
}