{
    "status": "success",
    "totalResults": 98,
    "results": [
        {
            "title": "Elizabeth Warren asks SEC to investigate Elon Musk’s dual roles at Twitter and Tesla",
            "link": "https://cryptoslate.com/elizabeth-warren-asks-sec-to-investigate-elon-musks-dual-roles-at-twitter-and-tesla/",
            "keywords": [
                "Featured",
                "Politics",
                "Regulation"
            ],
            "creator": [
                "Mike Dalton"
            ],
            "video_url": null,
            "description": "On July 17, Senator Elizabeth Warren called on the U.S. Securities and Exchange Commission (SEC) to initiate investigations into two companies led by Elon Musk, namely Tesla and Twitter, due to potential legal and ethical issues Warren began by reiterating concerns that she sent to Tesla in December 2022, all of which concern Musk’s dual leadership […] The post Elizabeth Warren asks SEC to investigate Elon Musk’s dual roles at Twitter and Tesla appeared first on CryptoSlate.",
            "content": "Share Tweet Post Share Post Email On July 17, Senator Elizabeth Warren called on the U.S. Securities and Exchange Commission (SEC) to initiate investigations into two companies led by Elon Musk , namely Tesla and Twitter, due to potential legal and ethical issues Warren began by reiterating concerns that she sent to Tesla in December 2022, all of which concern Musk’s dual leadership roles at Tesla and Twitter. Warren alleged that, following Musk’s acquisition of Twitter, he possibly misused Tesla resources by transferring over 50 employees from Tesla to Twitter. Throughout her letter to the SEC , she suggested that employee transfers may have involved costs that are relevant to investors and said that the action could be a violation of state and federal law. She also suggested that conflicts of interest could arise around promotion. Musk could conceivably boost Tesla in Twitter’s algorithms or provide Tesla with free advertising. Alternately, Twitter could accept advertisements from competing vehicle companies, earning immediate revenue at a cost to Tesla investors, Warren said. Warren additionally noted that Tesla investors have written an open letter criticizing Musk’s focus on non-Tesla ventures and have demanded a leadership succession plan. She added that Musk’s recent hiring of Linda Yaccarino as CEO of Twitter does not remove any conflict of interest due to his continued role as CTO of Twitter. The senator further observed that Musk has appointed friends and relatives to Tesla board positions and noted other signs that the board generally lacks independence. She named several areas of securities law under which the SEC could potentially begin an investigation, most of which concern Tesla’s failure to disclose the above issues. Musk, Warren are both focused on crypto Tesla is a Bitcoin investor and holds 10,725 BTC ($321.6 million), based on some reports . The firm also accepts Dogecoin ( DOGE ) as payment for some merchandise. Musk had also suggested the integration of Dogecoin with Twitter before he took over the company, a proposal that has so far resulted only in a change to the company’s logo . Warren, meanwhile, is known for her anti-crypto stances. She has criticized cryptocurrency’s use in sanctions evasions and the drug trade and has called for investigations into Binance and other firms. She has also expressed direct opposition to cryptocurrency, infamously stating she is “building an anti-crypto army.” Posted In: U.S. , Featured , Politics , Regulation Author Mike Dalton Journalist at CryptoSlate Before transitioning to crypto writing in 2018, Mike studied library and information sciences. Currently, he resides on Canada's West Coast. Editor Jacob Oliver Editor / Reporter at CryptoSlate Jacob Oliver is a recovering academic and English teacher who went down the crypto rabbit hole in 2017 after recognizing the technology's potential. Latest Report Could Bitcoin feel the BlackRock effect? BlackRock, the world's leading asset manager, shakes up the world of crypto with its recent application for a Bitcoin Exchange-Traded Fund (ETF), signaling a potential new era for Bitcoin investments and the broader digital assets landscape. Andjela Radmilac · 22 hours ago Latest Musk Stories Elon Musk formally enters the AI market with new company, xAI AI 5 days ago 2 min read Elon Musk says that China is ‘going to be great’ at AI development AI 2 weeks ago 2 min read Elon Musk’s Twitter-to-Doge logo switch raised as evidence in lawsuit Legal 2 months ago 1 min read Press Releases // View All Advertise Here LFG Market Integrates Portal to Offer Trustless Cross-chain Ordinals Trading Chainwire 8 hours ago HAQQ Becomes Istanbul Blockchain Week’s Title Sponsor Promoting Islamic Culture in Web3. News Desk 8 hours ago AAG Marks A New Era Of Web3 With Its Event In Manila Chainwire 10 hours ago Commitment to Transparency: The author of this article is invested and/or has an interest in one or more assets discussed in this post. CryptoSlate does not endorse any project or asset that may be mentioned or linked to in this article. Please take that into consideration when evaluating the content within this article. Disclaimer: Our writers' opinions are solely their own and do not reflect the opinion of CryptoSlate. None of the information you read on CryptoSlate should be taken as investment advice, nor does CryptoSlate endorse any project that may be mentioned or linked to in this article. Buying and trading cryptocurrencies should be considered a high-risk activity. Please do your own due diligence before taking any action related to content within this article. Finally, CryptoSlate takes no responsibility should you lose money trading cryptocurrencies.",
            "pubDate": "2023-07-18 01:05:17",
            "image_url": null,
            "source_id": "cryptoslate",
            "category": [
                "top"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "Elizabeth Warren asks SEC to investigate Elon Musk’s dual roles at Twitter and Tesla",
            "link": "https://en.news4social.com/cryptocurrency-news/elizabeth-warren-asks-sec-to-investigate-elon-musks-dual-roles-at-twitter-and-tesla/",
            "keywords": [
                "Cryptocurrency",
                "alt coin market",
                "asks",
                "best new crypto to buy",
                "best place to buy cryptocurrency reddit",
                "bitcoin price live india",
                "biticoin",
                "btc news today",
                "coin sites",
                "coinbase next coin",
                "coindesk bitcoin",
                "coingraph",
                "coinx trading",
                "crypto analysis",
                "crypto dive",
                "cryptocurrency 101",
                "cryptocurrency companies",
                "cryptocurrency events",
                "cryptocurrency news world",
                "Dual",
                "Elizabeth",
                "Elon",
                "ethereum max coin",
                "everything to know about cryptocurrency",
                "future of cryptocurrency 2016",
                "hottest crypto right now",
                "how to cryptocurrency",
                "how to invest in cryptocurrency stocks",
                "investigate",
                "is crypto.com down",
                "Musks",
                "roles",
                "SEC",
                "Tesla",
                "twitter",
                "vet coin news",
                "Warren",
                "what's going on with crypto market",
                "why are all cryptos down",
                "why crypto is going up",
                "why did cryptocurrency fall today",
                "why is crypto down so much"
            ],
            "creator": [
                "Cryptocurrency News"
            ],
            "video_url": null,
            "description": "Elizabeth Warren asks SEC to investigate Elon Musk’s dual roles at Twitter and Tesla On July 17, Senator Elizabeth Warren called on the U.S. Securities and Exchange Commission (SEC) to initiate investigations into two companies led by Elon Musk, namely Tesla and Twitter, due to potential legal and ethical issues Warren began by reiterating concerns that […]",
            "content": "(adsbygoogle = window.adsbygoogle || []).push({}); Elizabeth Warren asks SEC to investigate Elon Musk’s dual roles at Twitter and Tesla (adsbygoogle = window.adsbygoogle || []).push({}); On July 17, Senator Elizabeth Warren called on the U.S. Securities and Exchange Commission (SEC) to initiate investigations into two companies led by Elon Musk, namely Tesla and Twitter, due to potential legal and ethical issues (adsbygoogle = window.adsbygoogle || []).push({}); Warren began by reiterating concerns that she sent to Tesla in December 2022, all of which concern Musk’s dual leadership roles at Tesla and Twitter. Warren alleged that, following Musk’s acquisition of Twitter, he possibly misused Tesla resources by transferring over 50 employees from Tesla to Twitter. Throughout her letter to the SEC, she suggested that employee transfers may have involved costs that are relevant to investors and said that the action could be a violation of state and federal law. She also suggested that conflicts of interest could arise around promotion. Musk could conceivably boost Tesla in Twitter’s algorithms or provide Tesla with free advertising. Alternately, Twitter could accept advertisements from competing vehicle companies, earning immediate revenue at a cost to Tesla investors, Warren said. Warren additionally noted that Tesla investors have written an open letter criticizing Musk’s focus on non-Tesla ventures and have demanded a leadership succession plan. She added that Musk’s recent hiring of Linda Yaccarino as CEO of Twitter does not remove any conflict of interest due to his continued role as CTO of Twitter. The senator further observed that Musk has appointed friends and relatives to Tesla board positions and noted other signs that the board generally lacks independence. She named several areas of securities law under which the SEC could potentially begin an investigation, most of which concern Tesla’s failure to disclose the above issues. Musk, Warren are both focused on crypto Tesla is a Bitcoin investor and holds 10,725 BTC ($321.6 million), based on some reports. The firm also accepts Dogecoin (DOGE) as payment for some merchandise. (adsbygoogle = window.adsbygoogle || []).push({}); Musk had also suggested the integration of Dogecoin with Twitter before he took over the company, a proposal that has so far resulted only in a change to the company’s logo. Warren, meanwhile, is known for her anti-crypto stances. She has criticized cryptocurrency’s use in sanctions evasions and the drug trade and has called for investigations into Binance and other firms. She has also expressed direct opposition to cryptocurrency, infamously stating she is “building an anti-crypto army.” The post Elizabeth Warren asks SEC to investigate Elon Musk’s dual roles at Twitter and Tesla appeared first on CryptoSlate. Check More Latest Cryptocurrency News Click Here– Latest Cryptocurrency News Check More Business News Click Here– Latest Business News Tags: alt coin market asks best new crypto to buy best place to buy cryptocurrency reddit bitcoin price live india biticoin btc news today coin sites coinbase next coin coindesk bitcoin coingraph coinx trading crypto analysis crypto dive cryptocurrency 101 cryptocurrency companies cryptocurrency events cryptocurrency news world Dual Elizabeth Elon ethereum max coin everything to know about cryptocurrency future of cryptocurrency 2016 hottest crypto right now how to cryptocurrency how to invest in cryptocurrency stocks investigate is crypto.com down Musks roles SEC Tesla twitter vet coin news Warren what's going on with crypto market why are all cryptos down why crypto is going up why did cryptocurrency fall today why is crypto down so much",
            "pubDate": "2023-07-18 01:05:17",
            "image_url": null,
            "source_id": "news4social",
            "category": [
                "top"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk outmuscled by Mark Zuckerberg’s money in politics",
            "link": "https://www.rawstory.com/elon-musk-mark-zuckerberg/",
            "keywords": null,
            "creator": [
                "Emily Kennard, OpenSecrets"
            ],
            "video_url": null,
            "description": "This article originally appeared in OpenSecrets. Sign up for their weekly newsletter to receive stories like this one in your inbox.Billionaire tech titans Elon Musk and Mark Zuckerberg are seemingly training for a cage fight, but the duel is already playing out in the digital marketplace. Musk’s company Twitter took a hit in website traffic as its new competitor Threads surpassed records for online platform growth. Zuckerberg, founder and CEO of Meta, formerly named Facebook, boasted that its new app had garnered 100 million users in just five days. Musk initially proposed the cage match on June 20, in response to a tweet about Twitter’s upcoming rival, and Zuckerberg responded on Instagram, which Meta bought for $1 billion in 2012. After the launch of Threads, Twitter threatened Meta with legal action, calling the platform a “copycat” app. Musk and Zuckerberg have been dissing each other on their respective platforms ever since. Twitter is the newest company in Musk’s arsenal, alongside his electric vehicle company Tesla and his spacecraft manufacturing company SpaceX. Musk acquired the online platform for $44 billion in October 2022. Since Zuckerberg’s launch of Threads, their beef has been extensively covered, but their political contributions and extensive lobbying have gotten less attention. The outspoken tech CEOs and their companies have each spent millions over the years trying to sway government policy, but Meta’s federal lobbying spending has outpaced that of Musk’s companies since 2011.Political contributionsZuckerberg and his wife, Priscilla Chan, have personally donated at least $159,600 to federal candidates and committees. Meta’s PAC has received $100,000 from the couple since 2011. Of the $41,200 Zuckerberg gave directly to candidates and party committees since the 2012 election cycle, 62% of it went to Democratic causes. Chan also prefers to donate to Democrats, making $21,000 in contributions to Democratic candidates and political committees since 2014. The couple each gave $5,000 to the PAC for the 2022 elections, their only reported contributions that cycle.In 2021, Chan gave $750,000 to a group fighting California Gov. Gavin Newsom’s recall, her biggest political contribution to date. Zuckerberg’s largest-ever political contribution was $1 million given to a FWD.us California ballot measure committee before the 2016 election. FWD.us is a Silicon Valley-backed nonprofit he co-founded that focuses on immigration and criminal justice reform. His donation was used to support a successful ballot measure that increased parole options for nonviolent felons.Musk shelled out $725,750 in federal contributions from 2004 to 2020, giving an average of $80,639 per election cycle. Of the $688,350 that went directly to federal candidates and party committees, 50.1% went to Republican causes, though his ex-wife Justine Musk donated 86% of her political contributions to Democratic causes from 2004 to 2008 while they were married. No political committees reported contributions from Musk during the 2022 cycle, but he did endorse Republican congressional candidates on Twitter. The top recipient of Musk’s money is the National Republican Congressional Committee, which has received $246,800 from him since 2004.Company PACs and interest groupsCombined contributions from Meta employees and the Meta PAC have skewed heavily toward Democratic causes since 2016, but the Meta PAC by itself leans conservative, giving slightly more to Republicans since 2012. Of the $289,900 the Meta PAC gave directly to candidates and committees during the 2022 election cycle, 53% went to Republicans. Like other tech companies after the Jan. 6, 2021 Capitol riot, Meta – then called Facebook – paused its PAC’s political contributions to review its policies. It announced May 2021 the PAC would resume contributions but would not give any money to legislators who voted against certifying the 2020 election results.Musk has donated $30,000 to SpaceX’s corporate PAC over the years. SpaceX’s PAC gave $659,000 to federal candidates for the 2022 election cycle, and 53% went to Democrats. Unlike other tech companies after Jan. 6, 2021, SpaceX did not pause its contributions or review its PAC’s giving policies. During the 2022 election cycle, $179,000 of his company’s PAC funds went to at least 40 different federal Republican lawmakers who objected to the 2020 election results.Though Musk’s company PAC makes more contributions, Zuckerberg still had a powerful interest group at his disposal, FWD.us, where he was listed as a director on tax forms until June 2019. Musk was part of FWD.us until leaving in 2013, after FWD.us subsidiaries funded ad campaigns for prominent pro-Keystone Pipeline lawmakers. Since spending $2.4 million in 2014, FWD.us has taken a step back from federal political contributions, preferring instead to dedicate its money to state elections. FWD.us has spent $2.8 million in state-level political contributions since 2016. That election cycle, it spent $1.7 million just in California and Oklahoma alone. FWD.us also actively lobbies state governments, spending $4.5 million since it started doing so in 2017. It spent a record-breaking $1.6 million on federal lobbying in 2022 and racked up $400,000 in federal lobbying expenses just in the first three months of 2023 – its most active first quarter ever.LobbyingZuckerberg’s company, Meta — which owns Facebook, Instagram, WhatsApp, Threads and Oculus — spends millions per year lobbying, mostly about internet and technology issues. Like other Big Tech companies, Meta has spent big money lobbying against industry regulations and has also funded “dark money” groups that support its policy agenda.Meta has spent at least $1 million on federal lobbying per year since 2011, when it spent $1.35 million, and the company’s activity has since ballooned. With a combination of in-house lobbying and 23 different lobbying firms, Meta spent $4.6 million on federal lobbying in the first three months of 2023 after spending $19.2 million during 2022, less than the $20 million, record-breaking lobbying year the company had in 2021.Meanwhile, Twitter, which Elon Musk took control of in late 2022, spent just $310,000 lobbying the federal government in the first three months of 2023, about the same it spent in 2022’s first quarter.Musk’s electric vehicle company, Tesla, might be gearing up to drop big money lobbying the federal government this year, as it saw its most active first quarter ever, with $270,000 spent in the first three months of 2023 lobbying about tax and automotive industry issues across in-house lobbying and three different firms. It spent $770,000 in 2022. Source: OpenSecrets' analysis of Lobbying Disclosure Act filing data through Q1 of 2023.SpaceX spent $690,000 so far in 2023, mostly lobbying about aerospace, defense and telecommunications issues. It spent $2.7 million lobbying the government in 2022, the most it ever has. Musk’s other projects, Neuralink, which says it’s developed a brain-computer interface, and the Boring Company, which constructs tunnels, have reported no federal or state lobbying in the 19 states OpenSecrets tracks disclosures.According to Good Jobs First’s Subsidy Tracker, since 2009, Tesla has received $2.8 billion in government subsidies. About 88% of those subsidies came from states, while the rest came from federal grants. The state of Nevada has given Tesla $1.6 billion across tax rebates and grants from 2013 to 2023. Texas gave SpaceX a $2.3 million grant in 2014, and California gave the company $716,750 for training reimbursements. Musk’s companies also frequently use federal loans, as Tesla has received $466.5 million and SpaceX has received $106.1 million since 2010.Meta has received most of its $1.1 billion in government subsidies from states and municipalities, as only $274,477 came from federal grants. Its highest subsidy came from a Georgia municipality that gave the company $355 million in 2020, and its second-highest subsidy comes from the state of Nebraska, which gave the company $192 million in tax rebates in 2022.State and local Meta’s state-level lobbying is also extensive, totaling $11.7 million in expenditures since 2010 across the 19 states where OpenSecrets tracks lobbying activity. Tesla outmatched this spending with a staggering $16.4 million spent on state-level lobbying since 2010, showing that Tesla prefers spending its lobbying money trying to influence state policy, especially regarding regulations on direct-to-consumer automobile sales. SpaceX has spent $3.5 million on state-level lobbying since 2012. Meta, however, drops more money trying to influence state elections, as it made $4.5 million in state-level contributions since 2010, compared with Tesla’s $965,234 and SpaceX’s $47,950. Twitter typically stayed out of state elections, and it’s too soon to see yet if Musk’s reign will change this. It entered the state lobbying world in 2019 and has since spent $418,710.Though the Chan Zuckerberg Initiative — the couple’s philanthropic company — has never reported any lobbying, it gave $32.1 million total to ballot measure committees during the 2018 and 2020 state and local elections. At least $12.7 million of those funds went to support California’s failed proposition 15 in 2020, which would have changed state tax laws to increase school funding. The initiative also gave money for ballot measures focused on criminal justice, such as when the company gave $2 million in 2018 to an Ohio committee supporting a failed ballot measure that would have reduced punishments for drug use. In 2020, it gave $2.3 million to a committee opposing a failed California ballot measure that would have restricted parole for nonviolent drug users. The Chan Zuckerberg Initiative’s employees and affiliates gave almost exclusively to Democrats for a combined $478,662 in federal contributions during those cycles, but only gave $26,923 in the 2022 federal election cycle.If the still-unconfirmed fight doesn’t happen, it’s probably safe to expect more public feuding between the Meta founder and Twitter owner, or at the very least more posts about Zuckerberg’s training. Individual Contributions Researcher Alex Baumgart contributed to this report.OpenSecrets is a nonpartisan, independent and nonprofit research and news organization tracking money in U.S. politics and its effect on elections and public policy.",
            "content": "This article originally appeared in OpenSecrets . Sign up for their weekly newsletter to receive stories like this one in your inbox. Billionaire tech titans Elon Musk and Mark Zuckerberg are seemingly training for a cage fight , but the duel is already playing out in the digital marketplace. Musk’s company Twitter took a hit in website traffic as its new competitor Threads surpassed records for online platform growth. Zuckerberg, founder and CEO of Meta , formerly named Facebook, boasted that its new app had garnered 100 million users in just five days. Musk initially proposed the cage match on June 20, in response to a tweet about Twitter’s upcoming rival, and Zuckerberg responded on Instagram, which Meta bought for $1 billion in 2012. After the launch of Threads, Twitter threatened Meta with legal action, calling the platform a “copycat” app . Musk and Zuckerberg have been dissing each other on their respective platforms ever since. Twitter is the newest company in Musk’s arsenal, alongside his electric vehicle company Tesla and his spacecraft manufacturing company SpaceX . Musk acquired the online platform for $44 billion in October 2022 . Since Zuckerberg’s launch of Threads, their beef has been extensively covered, but their political contributions and extensive lobbying have gotten less attention. The outspoken tech CEOs and their companies have each spent millions over the years trying to sway government policy, but Meta’s federal lobbying spending has outpaced that of Musk’s companies since 2011. Political contributions Zuckerberg and his wife, Priscilla Chan, have personally donated at least $159,600 to federal candidates and committees. Meta ’s PAC has received $100,000 from the couple since 2011. Of the $41,200 Zuckerberg gave directly to candidates and party committees since the 2012 election cycle, 62% of it went to Democratic causes. Chan also prefers to donate to Democrats, making $21,000 in contributions to Democratic candidates and political committees since 2014. The couple each gave $5,000 to the PAC for the 2022 elections, their only reported contributions that cycle. In 2021, Chan gave $750,000 to a group fighting California Gov. Gavin Newsom’s recall, her biggest political contribution to date. Zuckerberg’s largest-ever political contribution was $1 million given to a FWD.us California ballot measure committee before the 2016 election. FWD.us is a Silicon Valley-backed nonprofit he co-founded that focuses on immigration and criminal justice reform . His donation was used to support a successful ballot measure that increased parole options for nonviolent felons . Musk shelled out $725,750 in federal contributions from 2004 to 2020, giving an average of $80,639 per election cycle. Of the $688,350 that went directly to federal candidates and party committees, 50.1% went to Republican causes, though his ex-wife Justine Musk donated 86% of her political contributions to Democratic causes from 2004 to 2008 while they were married. No political committees reported contributions from Musk during the 2022 cycle, but he did endorse Republican congressional candidates on Twitter . The top recipient of Musk’s money is the National Republican Congressional Committee , which has received $246,800 from him since 2004. Company PACs and interest groups Combined contributions from Meta employees and the Meta PAC have skewed heavily toward Democratic causes since 2016, but the Meta PAC by itself leans conservative, giving slightly more to Republicans since 2012. Of the $289,900 the Meta PAC gave directly to candidates and committees during the 2022 election cycle, 53% went to Republicans. Like other tech companies after the Jan. 6, 2021 Capitol riot, Meta – then called Facebook – paused its PAC’s political contributions to review its policies. It announced May 2021 the PAC would resume contributions but would not give any money to legislators who voted against certifying the 2020 election results. Musk has donated $30,000 to SpaceX ’s corporate PAC over the years. SpaceX’s PAC gave $659,000 to federal candidates for the 2022 election cycle, and 53% went to Democrats. Unlike other tech companies after Jan. 6, 2021, SpaceX did not pause its contributions or review its PAC’s giving policies. During the 2022 election cycle, $179,000 of his company’s PAC funds went to at least 40 different federal Republican lawmakers who objected to the 2020 election results. Though Musk’s company PAC makes more contributions, Zuckerberg still had a powerful interest group at his disposal, FWD.us, where he was listed as a director on tax forms until June 2019 . Musk was part of FWD.us until leaving in 2013 , after FWD.us subsidiaries funded ad campaigns for prominent pro-Keystone Pipeline lawmakers. Since spending $2.4 million in 2014, FWD.us has taken a step back from federal political contributions, preferring instead to dedicate its money to state elections. FWD.us has spent $2.8 million in state-level political contributions since 2016. That election cycle, it spent $1.7 million just in California and Oklahoma alone. FWD.us also actively lobbies state governments, spending $4.5 million since it started doing so in 2017. It spent a record-breaking $1.6 million on federal lobbying in 2022 and racked up $400,000 in federal lobbying expenses just in the first three months of 2023 – its most active first quarter ever. Lobbying Zuckerberg’s company, Meta — which owns Facebook, Instagram, WhatsApp, Threads and Oculus — spends millions per year lobbying, mostly about internet and technology issues. Like other Big Tech companies, Meta has spent big money lobbying against industry regulations and has also funded “dark money” groups that support its policy agenda. Meta has spent at least $1 million on federal lobbying per year since 2011, when it spent $1.35 million, and the company’s activity has since ballooned. With a combination of in-house lobbying and 23 different lobbying firms, Meta spent $4.6 million on federal lobbying in the first three months of 2023 after spending $19.2 million during 2022, less than the $20 million, record-breaking lobbying year the company had in 2021. Meanwhile, Twitter , which Elon Musk took control of in late 2022, spent just $310,000 lobbying the federal government in the first three months of 2023, about the same it spent in 2022’s first quarter. Musk’s electric vehicle company, Tesla , might be gearing up to drop big money lobbying the federal government this year, as it saw its most active first quarter ever, with $270,000 spent in the first three months of 2023 lobbying about tax and automotive industry issues across in-house lobbying and three different firms. It spent $770,000 in 2022. Source: OpenSecrets' analysis of Lobbying Disclosure Act filing data through Q1 of 2023. SpaceX spent $690,000 so far in 2023, mostly lobbying about aerospace, defense and telecommunications issues. It spent $2.7 million lobbying the government in 2022, the most it ever has. Musk’s other projects, Neuralink , which says it’s developed a brain-computer interface, and the Boring Company, which constructs tunnels, have reported no federal or state lobbying in the 19 states OpenSecrets tracks disclosures. According to Good Jobs First’s Subsidy Tracker , since 2009, Tesla has received $2.8 billion in government subsidies. About 88% of those subsidies came from states, while the rest came from federal grants. The state of Nevada has given Tesla $1.6 billion across tax rebates and grants from 2013 to 2023. Texas gave SpaceX a $2.3 million grant in 2014, and California gave the company $716,750 for training reimbursements. Musk’s companies also frequently use federal loans, as Tesla has received $466.5 million and SpaceX has received $106.1 million since 2010. Meta has received most of its $1.1 billion in government subsidies from states and municipalities, as only $274,477 came from federal grants. Its highest subsidy came from a Georgia municipality that gave the company $355 million in 2020, and its second-highest subsidy comes from the state of Nebraska, which gave the company $192 million in tax rebates in 2022. State and local Meta’s state-level lobbying is also extensive, totaling $11.7 million in expenditures since 2010 across the 19 states where OpenSecrets tracks lobbying activity. Tesla outmatched this spending with a staggering $16.4 million spent on state-level lobbying since 2010, showing that Tesla prefers spending its lobbying money trying to influence state policy, especially regarding regulations on direct-to-consumer automobile sales . SpaceX has spent $3.5 million on state-level lobbying since 2012. Meta, however, drops more money trying to influence state elections, as it made $4.5 million in state-level contributions since 2010, compared with Tesla’s $965,234 and SpaceX’s $47,950 . Twitter typically stayed out of state elections, and it’s too soon to see yet if Musk’s reign will change this. It entered the state lobbying world in 2019 and has since spent $418,710. Though the Chan Zuckerberg Initiative — the couple’s philanthropic company — has never reported any lobbying, it gave $32.1 million total to ballot measure committees during the 2018 and 2020 state and local elections. At least $12.7 million of those funds went to support California’s failed proposition 15 in 2020, which would have changed state tax laws to increase school funding. The initiative also gave money for ballot measures focused on criminal justice, such as when the company gave $2 million in 2018 to an Ohio committee supporting a failed ballot measure that would have reduced punishments for drug use. In 2020, it gave $2.3 million to a committee opposing a failed California ballot measure that would have restricted parole for nonviolent drug users. The Chan Zuckerberg Initiative’s employees and affiliates gave almost exclusively to Democrats for a combined $478,662 in federal contributions during those cycles, but only gave $26,923 in the 2022 federal election cycle. If the still-unconfirmed fight doesn’t happen, it’s probably safe to expect more public feuding between the Meta founder and Twitter owner, or at the very least more posts about Zuckerberg’s training. Individual Contributions Researcher Alex Baumgart contributed to this report. OpenSecrets is a n onpartisan, independent and nonprofit research and news organization tracking money in U.S. politics and its effect on elections and public policy. Abraham Hamadeh won’t be granted a third try at overturning his 2022 loss, after a Mohave County judge ruled that he lacks both the evidence and legal basis to do so. Hamadeh, the Republican nominee for attorney general, narrowly failed to capture the office, losing by a mere 280 votes. Spurred by conservative outrage over Election Day issues in Maricopa County, Hamadeh immediately went to court to contest the race, claiming his loss was the result of election misconduct and erroneously rejected ballots. His first challenge was thrown out for violating the timelines governing election contests and a second attempt filed shortly after, which did go to trial, was ultimately rejected for failing to meet the burden of proof. GET THE MORNING HEADLINES DELIVERED TO YOUR INBOX SUBSCRIBE When the automatic statewide recount of his race identified discrepancies that shrank Democrat Kris Mayes’ lead over Hamadeh — up until then thought to be 511 votes — the Republican candidate launched a third challenge , arguing that the new information warranted another trial. The vast majority of the votes that narrowed the contest came from Pinal County, where elections officials discovered hundreds of ballots that were mistakenly not counted after the election. Mohave County Superior Court Judge Lee Jantzen, however, disagreed. On Friday, Jantzen issued a short dismissal of Hamadeh’s request for a new trial. On Monday he clarified his reasoning . Time and ballot inspection constraints disqualify request Election contests, Jantzen said, are by nature swiftly dealt with, and the laws governing them don’t allow for drawn out deliberation. State law mandates that lawsuits challenging the outcome of an election be filed within five days of the statewide canvass, that a trial must begin no later than 15 days afterward and that the judge is directed to make a decision immediately — all of which happened during Hamadeh’s second lawsuit. Jantzen also rejected Hamadeh’s request to inspect more ballots to make his case. At a pre-trial hearing in May , attorneys for Hamadeh argued that more than 1,000 provisional ballots were incorrectly thrown out by Maricopa County election officials, including hundreds of votes belonging to residents whose voter registrations were erroneously filed in a different county due to alleged issues with ServiceArizona, the Arizona Department of Transportation’s self-service website, and Arizona’s voter registration database. No proof was offered, however, and attorneys lobbied for permission to search for evidence via more ballot inspections. Such permission, Jantzen said, would be out of line with what state law allows, especially after a limited inspection was granted during Hamadeh’s second challenge, resulting in no satisfactory proof of his claims. “Plaintiff was alleging issues with provisional ballots from the opening of this case but provided no significant evidence of specific problems at the trial on the merits,” Jantzen wrote. “The Plaintiff is now requesting additional discovery to investigate if a problem exists with provisional ballots. There is only limited discovery allowed in elections contests.” No new information means no new trial The only other avenue for greenlighting a new trial would be under the auspices of a procedural rule, but Jantzen said Hamadeh’s suit doesn’t meet that standard, either. Under the Arizona Rule of Civil Procedure 59, a new trial can be awarded if, among other reasons, new information came to light that was available at the time of the previous trial but couldn’t be acquired through due diligence and would have made a difference in the election’s outcome. Hamadeh’s third challenge relied heavily on Rule 59, arguing that the discrepancies identified during the statewide recount, coupled with a list of provisional voters requested from Maricopa County that was delivered after the December trial, warranted a second trial. Attorneys for Mayes rebutted, saying that the public records request filed in Maricopa County was submitted late, and Hamadeh’s campaign knew since at least November 2022, during his first challenge, that they’d need more information on issues with provisional ballots to bolster their arguments. Jantzen appeared to agree with that assessment. “The evidence of potential problems with provisional ballots and people with multiple addresses that was proffered at the time of oral argument was information that was discoverable in November and December with sufficient diligence,” he wrote. Jantzen rejected Hamadeh’s argument that the discrepancy found in Pinal County necessarily meant discrepancies in other counties. The same recount that identified the problem in Pinal County rectified the final tally and didn’t identify issues anywhere else. The final count still affirmed Mayes’ win. “The record reflects those errors were corrected in the recount and those 63 votes were counted,” Jantzen wrote. “(Hamadeh) speculates that this error was repeated in other counties but has no proof.” Appeal on the horizon Despite shooting down the request, Jantzen left the door open for an appeal to the Arizona Supreme Court. “The Plaintiff can appeal the decision made in this Court…but a new trial with extended discovery is not available under the road map laid out by the Legislature,” he wrote. In a statement released on social media shortly after Jantzen’s dismissal was announced last week, Hamadeh reiterated his belief that he is the lawful winner of the attorney general’s race. “The contest was not as close as it stands now. If all legal votes are counted, I win this race for attorney general,” he wrote. And on Monday, Hamadeh vowed to continue his legal battle. “The court’s ruling is an invitation to an appeal, and we will do just that,” he tweeted . SUPPORT NEWS YOU TRUST. DONATE Arizona Mirror is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity. Arizona Mirror maintains editorial independence. Contact Editor Jim Small for questions: info@azmirror.com . Follow Arizona Mirror on Facebook and Twitter . CONTINUE READING Show less MSNBC host and former White House Press Secretary Jen Psaki said Monday that if the recent past is any indication, potential new indictments against Donald Trump are likely to reveal more detail than is expected. Psaki discussed the prospect of new revelations emerging during an appearance on the network’s “ Joe Scarborough Presents .” “Remember in the weeks leading up to the Mar-a-Lago indictment, and we all were talking about how horrible it is to mistreat classified information – we've seen there's been a range of reporting, and then the indictment came out and it was shockingly worse,” Psaki said. Psaki noted that allegations that Trump mishandled documents containing nuclear secrets among weren’t known until special counsel Jack Smith indicted the former president. “The legal process – and we'll see what happens in the Georgia case and we'll see of course, what Jack Smith has on January 6 – has been working as it should, meaning, yes, there's been excellent reporting, but most of it is not leaking out of these prosecutors’ offices, so if they move forward, we learn a great deal more than we do before,” Psaki said. “And I had interviewed (Rep.) Jamie Raskin (D-Md.) last week, and he said, ‘I'm interested in hearing what Jack Smith has about these high level conversations because we didn't have time to get to that level of detail,’ and they did a lot in the January 6 committee,” Psaki said. “So my point is indictments, if they're coming are going to have a lot more detail. They're gonna give us a lot more information in all likelihood, if past precedent of the last two are examples.” Watch the video below or click here. MSNBC 07 17 2023 20 20 45 www.youtube.com CONTINUE READING Show less A prominent gun safety activist on Sunday slammed country music star Jason Aldean over a controversial song that’s described in a published report as an incendiary call for vigilantism against social justice advocates. Aldean’s “ Try That in a Small Town ” features incendiary lyrics accompanied by disturbing imagery, The Daily Beast reports . “Got a gun that my granddad gave me / They say one day they’re gonna round up / Well, that (expletive) might fly in the city, good luck,” Aldean sings. Kyndall Cunningham writes for The Beast that if “the lyrics weren’t direct enough, the new music video for “Try That in a Small Town” shows Aldean and his band performing in front of a white municipal building with an American flag hanging from it. The rest of the video features footage of looters and rioters, including a Fox News broadcast during the 2020 riots that took place in Aldean’s native Georgia.” Aldean over the weekend was rushed from the stage after suffering an apparent heat stroke during a performance in Hartford, Connecticut. Cunningham writes that around “the same time Aldean was making headlines for his near-collapse on stage over the weekend, Twitter and TikTok users began criticizing his latest track for its racist dog whistles and promoting vigilante violence. Many have interpreted the song as pro-lynching.” Moms Demand Action founder Shannon Watts called out the country music star for promoting guns, noting Aldean was performing during the 2017 Las Vegas mass shooting that killed 58 people and wounded more than 400. “@Jason_Aldean- who was on-stage during the mass shooting at a Las Vegas concert in 2017 that killed 60 people and wounded over 400 more - has recorded a song called ‘Try That In A Small Town’ about how he and his friends will shoot you if you try to take their guns,” Watts tweeted . Read the full article here . Watch the video below or click here . Jason Aldean - Try That In A Small Town (Official Music Video) www.youtube.com CONTINUE READING Show less",
            "pubDate": "2023-07-17 22:24:23",
            "image_url": "https://www.rawstory.com/media-library/image.jpg?id=34345949&width=980",
            "source_id": "rawstory",
            "category": [
                "top"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk and other Tesla board members agree to return over $735 million in stock and cash",
            "link": "https://electrek.co/2023/07/17/elon-musk-tesla-board-members-agree-return-735-million-stock-cash/",
            "keywords": [
                "News"
            ],
            "creator": [
                "Fred Lambert"
            ],
            "video_url": null,
            "description": "Elon Musk and other Tesla board members have agreed to return over $735 million in stock awards and cash as part of a settlement of a lawsuit over the board’s compensation. more… The post Elon Musk and other Tesla board members agree to return over $735 million in stock and cash appeared first on Electrek.",
            "content": "Elon Musk and other Tesla board members have agreed to return over $735 million in stock awards and cash as part of a settlement of a lawsuit over the board’s compensation. In 2020, the Police and Fire Retirement System of Detroit, a Tesla shareholder, decided to sue Tesla over what it believed to be excessive board compensation that had been improperly awarded since 2017. The defendants include Elon Musk, CEO and board member at Tesla, his brother Kimbal Musk, media mogul James Murdoch, billionaire Larry Ellison, and virtually every Tesla board member of the last six years. They have received hundreds of millions of dollars worth of stock options over the years. To be fair, much of the value of those stock options has been due to the rise in the value of Tesla’s stock over those years. In a new filing with the court last week, Tesla has agreed with the plaintiff on a massive settlement that would see board members return over $735 million worth of stock awards and cash. As part of the settlement, Tesla directors don’t admit to any wrongdoing and settle “to eliminate the uncertainty, risk, burden, and expense of further litigation.” The settlement is significant. The directors agree to forfeit all compensation from 2021 to 2023. It means canceling existing stock options, returning stocks from options that were exercised, and even returning cash from stocks that were sold after the options were exercised. It adds up to $458 million worth of stocks and $276 million in cash being returned to Tesla. On top of the stocks and money being returned, Tesla’s board has also agreed to hire a new outside consultant to look into its board compensation. The judge overseeing the case, Chancellor Kathaleen St. J. McCormick, needs to approve the settlement before it becomes official. Interestingly, McCormick is also presiding over another compensation lawsuit related to Tesla, but this one is specifically about Elon Musk’s 2018 CEO compensation plan, which could be worth as much as $55 billion. Musk refused to settle this lawsuit, and the judge is expected to rule on it soon. That’s quite a settlement. I’ve tried to find out exactly how much each director is going to give back, but I couldn’t find the details yet. There are 12 defendants in total, as Tesla has cycled through a few board members over those years. To be honest, I’m not sure who is in the right here. Yes, that’s a lot of money for what is basically a part-time job. However, the board members’ jobs are to look after the interest of shareholders, and the shareholders want to see the stock’s value increase. It has increased quite a bit – over 1000% since 2017. You can argue whether or not they are doing a good job, but you can’t argue with the results. Either way, if it is approved – and it sounds like it will be – the settlement should have a major impact on the quarter during which it is approved, as Tesla will receive a lot of shares and cash back. and subscribe to the . Tesla is a transportation and energy company. It… Fred is the Editor in Chief and Main Writer at Electrek. You can send tips on Twitter (DMs open) or via email: fred@9to5mac.com Through Zalkon.com, you can check out Fred’s portfolio and get monthly green stock investment ideas. Get interesting investment ideas by Fred Lambert ChargePoint Home WiFi Enabled Electric Vehicle (EV) Charger",
            "pubDate": "2023-07-17 22:20:41",
            "image_url": null,
            "source_id": "electrek",
            "category": [
                "technology"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Twitter ad revenues halve since Elon Musk's £33bn takeover as social media site struggles under 'heavy debt load'",
            "link": "https://www.dailymail.co.uk/money/markets/article-12308173/Twitter-ad-revenues-halve-Elon-Musks-33bn-takeover-social-media-site-struggles-heavy-debt-load.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Billionaire Musk (pictured) said the social media site was being hampered by a '50% drop in advertising revenue' as well as its 'heavy debt load'.",
            "content": "Twitter ad revenues halve since Elon Musk's £33bn takeover as social media site struggles under 'heavy debt load' By Daily Mail City & Finance Reporter Updated: 21:50, 17 July 2023 e-mail 2 View comments Twitter has lost around half of its advertising revenue since Elon Musk bought the company for £33billion in October last year. The billionaire said the social media site was being hampered by a ‘50 per cent drop in advertising revenue’ as well as its ‘heavy debt load’. In a tweet, the tycoon said the company ‘did not see the increase in advertising revenue that was expected in June’. But Musk, 52, added: ‘July is a bit more promising.’ Twitter owner Elon Musk (pictured) said the social media site was being hampered by a '50% drop in advertising revenue' as well as its 'heavy debt load' Twitter has had a bumpy ride in the last nine months, having laid off more than half of its workforce to drive down costs. Musk said the company has reduced its debt pile to £1.2billion from a projected £3.4billion in 2023 because of these cuts. It was reported that many advertisers left Twitter after Musk first took the company private – largely out of fear of his lax moderation policies. In April, he told the BBC that ‘almost all advertisers have come back or said they are going to come back’. He has previously said that Twitter was on track to post £2.3billion in revenue in 2023, down from £3.9billion in 2021. RELATED ARTICLES Previous 1 Next Cartier-owner Richemont plunges as US slowdown and worries... Traders bet £3.6bn on pound rallying against the dollar as... Is China's boom turning to bust? Youth unemployment races to... Microsoft in the crosshairs: Allowing big tech to ride... Share this article Share HOW THIS IS MONEY CAN HELP How to choose the best (and cheapest) stocks and shares Isa and the right DIY investing account DIY INVESTING PLATFORMS Stocks & shares Isa Stocks & shares Isa Easy investing Capital at risk. Isa rules & T&Cs apply. Investment ideas Free fund dealing Free fund dealing 0.45% account fee capped for shares Flat-fee investing No fees £9.99 monthly fee One free £5.99 trade per month Social investing Social investing Share investing 30+ million global community Model portfolios Investment account Free fund dealing Free financial coaching Affiliate links: If you take out a product This is Money may earn a commission. This does not affect our editorial independence. > Compare the best investing platform for you Share or comment on this article: Twitter ad revenues halve since Elon Musk's £33bn takeover as social media site struggles under 'heavy debt load' e-mail Add comment Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence. Toggle Search POPULAR MONEY SECTIONS Take me to… Best savings rates tables Find the best mortgage calculator Power Portfolio investment tracker Stock market data and share prices This is Money's podcast This is Money's newsletter The best DIY investing platforms The best bank accounts The best cash Isas The best credit cards Save on energy bills Compare broadband and TV deals How to find cheaper car insurance Investing Show videos Financial calculators Search Enter search term Search Search within All articles Share prices Comments 3 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy . More top stories",
            "pubDate": "2023-07-17 20:50:18",
            "image_url": "https://i.dailymail.co.uk/1s/2023/07/17/20/73313051-0-image-m-3_1689621834434.jpg",
            "source_id": "dailymailuk",
            "category": [
                "business"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk comments on Ford F150 Lightning pricing as Tesla Cybertruck price is up in the air",
            "link": "https://electrek.co/2023/07/17/elon-musk-comments-ford-f150-lightning-pricing-tesla-cybertruck-price/",
            "keywords": [
                "News"
            ],
            "creator": [
                "Fred Lambert"
            ],
            "video_url": null,
            "description": "Elon Musk says the Ford F150 Lightning is too expensive, as Ford slashes the price to help demand catch up to increased production. As Tesla Cybertruck’s price is up in the air, some believe this could hint at the electric pickup truck coming in cheaper than the Lightning. more… The post Elon Musk comments on Ford F150 Lightning pricing as Tesla Cybertruck price is up in the air appeared first on Electrek.",
            "content": "Elon Musk says the Ford F150 Lightning is too expensive, as Ford slashes the price to help demand catch up to increased production. As Tesla Cybertruck’s price is up in the air, some believe this could hint at the electric pickup truck coming in cheaper than the Lightning. Today, . The electric pickup truck saw its price drop between $6,000 and $10,000, depending on the model, and it now starts at $50,000 – much closer to its original price before a major price increase last year. Tesla CEO Elon Musk commented on the F150 Lightning price drop today. The CEO said that he believes the electric pickup truck to be a “good vehicle,” but he believes that it is priced too high for the current high-interest market: The Ford Lightning is a good vehicle, just somewhat expensive, especially given the high interest rates these days for any kind of loan The comment is somewhat interesting in the context of Tesla preparing to bring its own electric pickup truck to market, the Cybertruck, and that the pricing is unknown. When , Tesla announced that the electric pickup truck would be offered in three different configurations: But Tesla has since removed this pricing from its website and signaled that the prices would change when the production version comes to market. This weekend, . The automaker is expected to announce the updated pricing at a delivery event later this quarter. Some people believe that Elon might be signaling that the Cybertruck will be cheaper than the Lightning. I am not so sure, but it could also mean that Elon believes the Cybertruck could be a better value. For example, to get the longer-range version of the F150 Lightning with 320 miles on a single charge, you need to spend at least $70,000. I doubt that we will see a Cybertruck starting at the same price as the Lightning Pro ($50,000) any time soon, maybe two or three years from now, but I can see Tesla releasing a Cybertruck for ~$70,000 with more than 320 miles of range. That would be a win for Tesla. But the Silverado EV will be harder to compete with . I don’t know if Tesla is going to reach that price point with its longest-range Cybertruck, but I think it will try its best to do that because keeping an electric truck under $80,000 gives buyers access to the full $7,500 federal tax credit. What do you think? Let us know in the comment section below. and subscribe to the . Tesla is a transportation and energy company. It… Telsa Cybertruck will be released in 2021 with a… Fred is the Editor in Chief and Main Writer at Electrek. You can send tips on Twitter (DMs open) or via email: fred@9to5mac.com Through Zalkon.com, you can check out Fred’s portfolio and get monthly green stock investment ideas. Get interesting investment ideas by Fred Lambert ChargePoint Home WiFi Enabled Electric Vehicle (EV) Charger",
            "pubDate": "2023-07-17 20:26:31",
            "image_url": null,
            "source_id": "electrek",
            "category": [
                "technology"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Twitter loses nearly half advertising revenue since Elon Musk takeover",
            "link": "https://www.ghanamma.com/wn/2023/07/17/twitter-loses-nearly-half-advertising-revenue-since-elon-musk-takeover/",
            "keywords": [
                "World"
            ],
            "creator": [
                "Ghana News"
            ],
            "video_url": null,
            "description": "\r \r \r Twitter has lost almost half of its advertising revenue since it was bought by Elon Musk for $44bn (£33.6bn) last October, its owner has revealed. He said the company had not seen the increase in sales that had been expected in June, but added that July was a “bit more promising”. Mr […] The post Twitter loses nearly half advertising revenue since Elon Musk takeover appeared first on Ghanamma.com.",
            "content": "Twitter has lost almost half of its advertising revenue since it was bought by Elon Musk for $44bn (£33.6bn) last October, its owner has revealed. He said the company had not seen the increase in sales that had been expected in June, but added that July was a “bit more promising”. Mr Musk sacked about half of Twitter’s 7,500 staff when he took over in 2022 in an effort to cut costs. Rival app Threads now has 150 million users, according to some estimates. Its in-built connection to Instagram automatically gives the Meta-designed platform access to a potential two billion users. Meanwhile, Twitter is struggling under a heavy debt load. Cash flow remains negative, Mr Musk said at the weekend, although the billionaire did not put a time frame on the 50% drop in ad revenue. In a tweet, he said: “Need to reach positive cash flow before we have the luxury of anything else.” After laying off thousands of employees and cutting cloud service bills, Mr Musk said Twitter was on track to post $3bn (£2.29bn) in revenue in 2023, down from $5.1bn in 2021. The development is the latest sign the aggressive cost-cutting measures have not been enough to ignite a return of advertisers who fled after changes to its content moderation rules. That is despite an interview Mr Musk gave to the BBC in April, in which he suggested that most had returned to the site. However, Meghana Dhar, the former head of partnerships at Snap and Meta, which owns the new Twitter rival Threads, said the company had been struggling prior to Mr Musk’s buyout. “Elon and Twitter are in a candidly tough position right now,” she told the BBC’s Today programme. “To be fair to Elon though, we’ve seen that decline in Twitter revenue and growth in revenue since pre-Elon – there’s been kind of a steady decline.” Lucy Coutts, investment director at JM Finn, said: “You wouldn’t bet against him, he’s a kind of mercurial figure and I think probably he will turn it around but it is just going to take longer. “But unfortunately he has got $13bn of debt to pay by the end of July so we may see more pressure on the shares in Tesla if he has to sell more of his stake in that company.” Mr Musk is also the chief executive and majority shareholder of electric car maker Tesla, which will report its latest quarterly financial results on Wednesday. Linda Yaccarino, previously head of advertising at NBCUniversal, was taken on as chief executive of Twitter in June – a move suggesting advertising sales are still a priority for the company. Ms Yaccarino has said Twitter plans to focus on video, creator and commerce partnerships. It is said to be in early talks with political and entertainment figures, payments services, and news and media publishers. Twitter loses nearly half advertising revenue since Elon Musk takeover – . Source Save my name, email, and website in this browser for the next time I comment.",
            "pubDate": "2023-07-17 20:24:49",
            "image_url": null,
            "source_id": "ghanamma",
            "category": [
                "world"
            ],
            "country": [
                "ghana"
            ],
            "language": "english"
        },
        {
            "title": "DOGE Skyrockets Within Minutes Following Elon Musk's Tweet",
            "link": "https://www.ibtimes.com/doge-skyrockets-within-minutes-following-elon-musks-tweet-3705462",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "It appears that the ongoing lawsuit does not discourage Musk from doing what he is usually doing, and that is, shilling Dogecoin at every chance he gets.",
            "content": "NEWSLETTER SIGNUP My account Log Out Jul 17, 6:16 PM EDT Business Technology World National Politics Media & Culture Opinion Sports Social Capital Crypto NEWSLETTER My account Log Out US Edition Business Technology World National Politics Media & Culture Opinion Sports Social Capital Crypto Listings & More Spotlight Glossary Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States NEWSLETTER Follow Us Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States Crypto Crypto Business DOGE Skyrockets Within Minutes Following Elon Musk's Tweet By Nica Osorio @nicaIBTimes 07/17/23 AT 4:16 PM EDT Share on Facebook Share on Twitter Share on LinkedIn Share on Reddit Share on Flipboard Elon Musk first touted the dogecoin Twitter/ElonMusk In a not-so-surprising turn of events, Dogecoin, the world's first-ever meme coin, made an explosive climb within a minute after tech billionaire and DogeFather Elon Musk tweeted about DOGE. Data from crypto aggregator CoinMarketCap revealed that Dogecoin experienced a price surge Monday when it saw a 3% gain and traded at $0.073 from its previous price of $0.07. Known for his interactions with the cryptocurrency community, particularly with Dogecoin, the \"Chief Twit\" responded to a question on the social media platform asking for his preference between cats and dogs. The tech billionaire and head honcho of tech companies such as Tesla , SpaceX and Twitter , responded to the question and answered, \"Doges,\" which immediately pumped the price of the meme coin. Doges — Elon Musk (@elonmusk) July 17, 2023 Following Musk's tweet, the DOGE market was flooded by large volumes of trade, which appeared to be initiated by automated buying bots set to function at the tech billionaire's mention of Dogecoin or DOGE on the social media platform. Musk's fondness for Dogecoin was used by some DOGE investors who filed a class-action lawsuit and accused him of insider trading. In the third amendment of the ongoing $258 billion lawsuit, Dogecoin investors alleged that Musk's bullish moves manipulated the price of the meme coin, which cost them billions of dollars. The amendment centered on the \"deliberate course of carnival barking, market manipulation and insider trading\" allegedly devised by Musk to artificially boost the price of Dogecoin by more than 36,000% and then let it crash, to short the value of the crypto asset The plaintiffs previously alleged that Musk used his posts on Twitter, paid influencers and used his appearance on \"Saturday Night Live\" in 2021 to amp up the value of DOGE. Recently, a new court filing accused Musk of defrauding investors while promoting Dogecoin and claimed that the Tesla CEO, along with his lawyer Alex Spiro are using \"unlawful\" strategies to discredit Evan Spencer, the lawyer representing the plaintiffs and his clients. \"The only possible way that Spiro's letter could have found its way into the New York Post is if Defense Counsels or an agent or subordinate acting on their behalf provided it to the Post,\" Spencer said asserting that Spiro had revealed a confidential document between the two to the New York Post. The document, according to Spencer, was originally sent to him, which refuted that allegations against Musk lacked foundation. But, it appears that the ongoing lawsuit does not discourage Musk from doing what he is usually doing, and that is, shilling Dogecoin at every chance he gets. DOGE was down by 1.66% and was trading in the red zone at $0.06895 over the past 24 hours with its trading volume up by 25.27% at $486,366,694 as of 3:33 p.m. ET on Monday, based on the latest data from CoinMarketCap. Read more Shiba Inu Decentralized Tokens Dominate Top CoinMarketCap Trending Token List Musk Shills DOGE Again, Confirms Offer To McDonald's Still Up New Shiba Inu Global Milestone: HKVAC Lists SHIB In Virtual Asset Index Elon musk REGISTER FOR FREE to continue reading ✔️ Unlock the full content of International Business Times UK for free offer available for a limited time only ✔️ Easily manage your Newsletters subscriptions and save your favourite articles ✔️ No payment method required Already have an account? Log in © Copyright IBTimes 2023. All rights reserved. Join the Discussion MOST READ IN Crypto 1 Binance Lays Off 1,000 Employees, Could Cut Thousands More Jobs Amid DOJ Probe: Reports 2 Ripple CEO Says SEC 'Sowed Confusion In The Market,' Regulator's Appeal Could Take 'Years' 3 SEC Throws Shade On Coinbase Compliance As Judge Seemingly Aligns With CEX 4 Crypto Will 'Transcend' US Dollar, Other Traditional Currencies, BlackRock CEO Predicts 5 Bitcoin To Reach New Heights But Will See Downturn First, Says Top Crypto Trader NEWS Business Technology World National Politics Media & Culture Opinion Sports Crypto Featured Social Capital Glossary SMB Forum Spotlight ABOUT About Us Contact us Advertise with us Terms & Conditions Privacy Policy Cookie Policy Editions United States Australia Brazil Colombia France Germany Indonesia India International Italy Japan Editions Nigeria Philippines Singapore South Africa South Korea Spain Mexico Taiwan United Arab Emirates United Kingdom FOLLOW US Facebook Twitter LinkedIn Newsletter © Copyright 2023 IBTimes LLC. All Rights Reserved.",
            "pubDate": "2023-07-17 20:16:26",
            "image_url": null,
            "source_id": "ibtimes",
            "category": [
                "sports"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Tesla builds first Cybertruck nearly 4 years after Elon Musk unveiled it",
            "link": "https://www.cbsnews.com/news/tesla-first-cybertruck-electric-vehicle-gigafactory-elon-musk/",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Electric pickup set to enter an increasingly competitive EV market, with Tesla battling rivals including Ford and GM.",
            "content": "Tesla has manufactured its first Cybertruck nearly four years after founder and CEO Elon Musk touted the automaker's first electric pickup. Tesla workers at the company's so-called Gigafactory near Austin, Texas, tweeted a photo of the completed vehicle on Saturday with the caption \"First Cybertruck built in Giga Texas.\" The feat comes four years after CEO Elon Musk introduced the silver, futuristic-looking vehicle. Musk originally unveiled the Cybertruck in 2019 with the goal of starting production in late 2021. First Cybertruck built at Giga Texas! 🤠 pic.twitter.com/ODRhHVsd0t — Tesla (@Tesla) July 15, 2023 The Cybertruck's stainless steel alloy body is strong enough to withstand certain types of small arms fire, Musk has said. He has also estimated the truck will be capable of towing 14,000 pounds. It's unclear when Cybertrucks will be available for purchase from a dealership lot or at what price. Musk said in April that the company expects to deliver the first truck sometime between July and September. Tesla didn't immediately respond to a request for comment. When it does hit dealer floors, the Cybertruck will be entering an increasingly competitive electric vehicle market, including for pickups. Rival company Rivian sells its R1T, with a starting price of $73,000, according to Kelley Blue Book; General Motors offers the Hummer EV pickup; and Ford makes the F-150 Lightning. Ford on Monday dropped the price on seven models of the Lightning by between $6,000 and $10,000, citing easier access to the truck's battery material. The cuts partially reverse repeated price hikes in 2022 and early 2023, which the car maker blamed on higher material costs. Experts worry about heavy electric vehicles' safety 02:32 Another factor motivating Ford to cut prices could be that company officials \"hear the footsteps of the Cybertruck and others such as Rivian coming,\" Dan Ives, an analyst at Wedbush Securities, said in a research note. Tesla originally said it would make three versions of the Cybertruck, with prices ranging from about $40,000 to $70,000. Later the company removed prices from the webpage where customers could pre-order the vehicle. —The Associated Press contributed to this report. Trending News AAA pulls back from offering insurance in Florida, following Farmers Most Facebook users can now claim settlement money. Here's how. College students shun teaching as a career, a crisis for U.S. schools Buy a home now and refinance it later? Here's what experts think Travelers save money on flights by \"skiplagging,\" but there are risks In: Tesla Khristopher J. Brooks Khristopher J. Brooks is a reporter for CBS MoneyWatch covering business, consumer and financial stories that range from economic inequality and housing issues to bankruptcies and the business of sports. Twitter",
            "pubDate": "2023-07-17 19:52:00",
            "image_url": "https://assets2.cbsnewsstatic.com/hub/i/r/2023/07/17/9f0f09a6-d8af-4f4c-b39d-9f8cf0d84f17/thumbnail/60x60/450a39bd65dffea7d213f72a008d674a/gettyimages-1241145795.jpg?v=596294ea7cf1c3a6f60cc964b1b476a6",
            "source_id": "cbsnews",
            "category": [
                "business"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk Reveals That Twitter Has 'Negative Cash Flow,' About 50% of Advertisers Still Gone",
            "link": "https://www.entrepreneur.com/business-news/elon-musk-says-twitter-has-negative-cash-flow-fewer-ad/455945",
            "keywords": [
                "News and Trends"
            ],
            "creator": [
                "Emily Rella"
            ],
            "video_url": null,
            "description": "The Twitter owner took to the platform over the weekend to explain the company's financial situation.",
            "content": "Things aren't exactly looking bright at Elon Musk's Twitter. Over the weekend, Musk revealed on the social media platform that the company is struggling to break even after his $44 billion acquisition last November. A Twitter user joked with the billionaire that he should create a \"consortium\" of people that share his vision for what the future of Twitter should become, to which Musk responded that the company doesn't have the \"luxury\" of testing any new ideas out right now because it has \"negative cash flow.\" Related: Who Is Twitter CEO Linda Yaccarino? College, Husband, Children Musk's antics on the platform and questionable business decisions upon purchasing it — from instating mass layoffs, ousting top executives on day one, removing the company's legacy blue checkmark program, and allowing previously banned accounts back on the app — have caused many major advertisers, such as Wells Fargo, to drop its advertising. By the end of January, roughly 60% of Twitter's top advertisers had dropped out. Related: Elon Musk and Mark Zuckerberg Feud Again as 'Threads' Launches A report from the Wall Street Journal earlier this year claimed that Twitter was offering companies free ads as an incentive to get them to continue spending money on the company, though Musk nor Twitter publicly confirmed the tactic. However, Musk told BBC in April that most of Twitter's advertisers had returned and that the company was already in a $3 billion cash deficit when he purchased it. Twitter was once a publicly traded company but became private under Musk when he finalized his purchase last fall. He stepped down as CEO this past May, appointing former NBCUniversal executive Linda Yaccarino to his position.",
            "pubDate": "2023-07-17 19:35:00",
            "image_url": null,
            "source_id": "entrepreneurmx",
            "category": [
                "business"
            ],
            "country": [
                "mexico"
            ],
            "language": "english"
        }
    ],
    "nextPage": "1689622500956b7e999536686f4f8242539beab017"
}