{
    "status": "success",
    "totalResults": 97,
    "results": [
        {
            "title": "Elon Musk Abandons “Silly” Twitter Policy Restricting Monetization Of Beagle Account",
            "link": "https://surgezirc.co.za/social-media/elon-musk-abandons-silly-twitter-policy-restricting-monetization-of-beagle-account/",
            "keywords": [
                "Social Media",
                "Tech",
                "#elon musk",
                "#Social Media",
                "Twitter"
            ],
            "creator": [
                "Jatuwase F. &#124; Sports &#38; Tech Writer"
            ],
            "video_url": null,
            "description": "In a recent announcement, Elon Musk, the owner of Twitter, stated that he is doing away with a controversial policy that prevented the monetization of an account dedicated to a beagle. Musk made this comment after a Twitter user, with over 102,000 followers, flagged the relevant section of Twitter’s help center page, prompting him to […] The post Elon Musk Abandons “Silly” Twitter Policy Restricting Monetization Of Beagle Account appeared first on SurgeZirc SA.",
            "content": "In a recent announcement, Elon Musk, the owner of Twitter, stated that he is doing away with a controversial policy that prevented the monetization of an account dedicated to a beagle. Musk made this comment after a Twitter user, with over 102,000 followers, flagged the relevant section of Twitter’s help center page, prompting him to take action. On Saturday, Musk tweeted, “Consider this silly policy deleted as of now,” in response to the issue raised by the account, which humorously tweeted, “Bag status: canceled,” upon discovering its inability to monetize tweets. According to the policy page, “Profiles featuring animals or fictional characters are ineligible for monetization, unless directly affiliated with your brand or organization. Parody and fan accounts are also excluded from subscription eligibility.” This move comes shortly after Twitter introduced a new ad-revenue program, which has already started compensating creators and influencers on the platform with substantial amounts. The program is part of Musk’s broader plan to reward users who pay a monthly fee for a verified blue checkmark on their profiles. Prominent figures like Andrew Tate and Tesla investor Sawyer Merritt were among the first users to confirm receiving payment from Twitter. Coincidentally, this month also witnessed the launch of “Threads,” a Twitter competitor created by Mark Zuckerberg. Impressively, Threads amassed over 100 million users within its first week, presenting a fresh challenge to Twitter, which has been grappling with declining revenue since Musk took over. On Saturday, the billionaire tweeted that Twitter is “still experiencing negative cash flow” due to a significant drop in advertising revenue, around 50%, and a “heavy debt load.” When contacted for comment, Twitter responded with an automated message to SurgeZirc SA’s request.",
            "pubDate": "2023-07-17 18:57:51",
            "image_url": null,
            "source_id": "surgezirc_sa",
            "category": [
                "top"
            ],
            "country": [
                "south africa"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk Warns Twitter is Still Cash Flow Negative",
            "link": "https://www.thurrott.com/cloud/285748/elon-musk-warns-twitter-still-cash-flow-negative",
            "keywords": [
                "Cloud",
                "Social",
                "Elon Musk",
                "Twitter"
            ],
            "creator": [
                "Laurent Giret"
            ],
            "video_url": null,
            "description": "Despite drastic cost-cutting measures and the hire of a new CEO to lure advertisers back, Elon Musk said that Twitter is still cash flow negative. The post Elon Musk Warns Twitter is Still Cash Flow Negative appeared first on Thurrott.com.",
            "content": null,
            "pubDate": "2023-07-17 17:47:05",
            "image_url": null,
            "source_id": "thurrott",
            "category": [
                "technology"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk’s Tesla builds its first Cybertruck, deets inside",
            "link": "https://telanganatoday.com/elon-musks-tesla-builds-its-first-cybertruck-deets-inside",
            "keywords": [
                "News",
                "Tech",
                "World",
                "Elon Musk",
                "Tesla"
            ],
            "creator": [
                "ANI"
            ],
            "video_url": null,
            "description": "The electric car company tweeted an image of workers in hard hats surrounding the sleek Cybertruck, which it said was built at its Gigafactory near Austin",
            "content": "Home | Tech | Elon Musks Tesla Builds Its First Cybertruck Deets Inside Elon Musk’s Tesla builds its first Cybertruck, deets inside The electric car company tweeted an image of workers in hard hats surrounding the sleek Cybertruck, which it said was built at its Gigafactory near Austin By ANI Published Date - 10:26 PM, Mon - 17 July 23 Los Angeles : Elon Musk’s company Tesla announced the production of its very first Cybertruck. Recently, the electric car company tweeted an image of workers in hard hats surrounding the sleek Cybertruck, which it said was built at its Gigafactory near Austin, Texas, CNN reported. Tesla revealed the prototype for the futuristic Cybertruck in 2019, saying production would begin in late 2021. The striking prototype looked like a large metal trapezoid on wheels, its exteriors made from a stainless steel alloy. However, a demonstration of the truck’s supposedly unbreakable windows in 2019 backfired when a metal ball thrown at the windows did, in fact, break them. Tesla remained mostly silent about plans for the highly anticipated vehicle, but in 2021 announced an updated version was coming. Tesla CEO Elon Musk said that the company couldn’t yet debut long-promised new vehicles, such as the Cybertruck pickup, due to supply chain issues. However, in January Tesla announced it would begin production of the Cybertruck later this year. It has previously said volume production of the vehicle is expected in 2024. As of November 2022, the Cybertruck had over 1.5 million reservations, according to a report from Electrek, TechCrunch reported. Also Read Tesla emerges as the most sought-after car brand globally, says report Elon Musk says Twitter has negative cash flow due to ad revenue drop Follow Us : Tags Elon Musk Tesla Related News Musk’s SpaceX controls 60 per cent share of global launch biz as it eyes India Tesla emerges as the most sought-after car brand globally, says report Zuckerberg really burning midnight oil: Musk Zuckerberg doesn’t seem to care about Threads: Elon Musk Elon Musk says Twitter has negative cash flow due to ad revenue drop Twitter usage up by 3.5% week over week, claims Elon Musk",
            "pubDate": "2023-07-17 16:56:29",
            "image_url": null,
            "source_id": "telanganatoday",
            "category": [
                "science",
                "technology"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk Weighs In On Speculation: Are BlackRock And Vanguard The Shadow Government?",
            "link": "https://www.ibtimes.com/elon-musk-weighs-speculation-are-blackrock-vanguard-shadow-government-3705456",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Reports indicate that House Republicans are initiating an investigation into financial giants BlackRock and Vanguard. This move comes after U.S. presidential candidate Vivek Ramaswamy exposed alleged connections between these companies and the White House.",
            "content": "NEWSLETTER SIGNUP My account Log Out Jul 17, 3:48 PM EDT Business Technology World National Politics Media & Culture Opinion Sports Social Capital Crypto NEWSLETTER My account Log Out US Edition Business Technology World National Politics Media & Culture Opinion Sports Social Capital Crypto Listings & More Spotlight Glossary Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States NEWSLETTER Follow Us Editions Australia Edition India Edition International Edition Singapore Edition United Kingdom United States Crypto Crypto Business Elon Musk Weighs In On Speculation: Are BlackRock And Vanguard The Shadow Government? By Nica Osorio @nicaIBTimes 07/17/23 AT 12:47 PM EDT Share on Facebook Share on Twitter Share on LinkedIn Share on Reddit Share on Flipboard Reuters Tech billionaire Elon Musk weighed in on the major question making rounds online, that is, if financial giants like BlackRock and Vanguard are the shadow government. To some industry watchers, the thin line between Wall Street and Washington has always been blurry and this speculation is now being fueled by reports that House Republicans are set to launch an investigation into BlackRock and Vanguard following the expose of U.S. presidential candidate Vivek Ramaswamy. With things heating up in the financial sector following the allegations of Vivek, a Twitter user who uses the handle @WallStreetSilv asked their more than 928,000 followers, \"Are Blackrock and Vanguard [are] the shadow government?\" . The question stemmed from the retweeted post with the video from Twitter Spaces host with the handle @TaraBull808 who captioned the clip as, \"Vivek explains how the White House uses private actors like BlackRock to implement what they can't get passed through Congress, label it ESG, and claim it's good for the environment.\" In the shared video, Vivek explained how the White House hires private actors like BlackRock to execute policies that are challenged in the legislation, adding that these policies are usually labeled as ESG or Environmental, Social and Governance initiatives. \"Chief Twit\" Musk weighed in on the issue and said, \"There is a crazy amount of control that passive/index fund managers have over publicly traded companies.\" There is a crazy amount of control that passive/index fund managers have over publicly traded companies — Elon Musk (@elonmusk) July 16, 2023 BlackRock, the New York-based investment titan, has been making headlines over the past weeks since it filed for a spot Bitcoin exchange-traded fund (ETF) in the U.S. Securities and Exchange Commission (SEC). While the financial regulator returned its filing along with other applicants from the traditional financial sector, the commission accepted it last week. BlackRock is led by Larry Fink, the 70-year-old chairman and CEO of the firm, which according to Forbes , has a net worth of around $1 billion in 2023. Recently, the investment giant was at the center of controversy when James O'Keefe Media Group released last month a secretly recorded conversation between an undercover journalist and Serge Varlay, BlackRck's recruiter. In the video , Varlay boasted of BlackRock's ability to \"run the world\" by buying politicians. Another Wall Street giant mentioned by Vivek is the investment titan Vanguard, which is considered one of the Big Three index fund managers that play a crucial and major role in the corporate U.S. Vanguard is involved in Bitcoin mining and recently upped its exposure to the world's largest crypto asset when it increased its Marathon Digital holdings by 60% to 17.5 million from 10.9 million shares. Also, Vanguard pumped its stake in Riot Blockchain, a Colorado-based Bitcoin miner, by almost 18% to 17.9 million from 15.2 million shares , which is equivalent to more than $281 million in stock, underlining its total Bitcoin mining investment to $560 million. Read more Bitcoin Falls But Refuses To Trade Below $30,000 Price Level Will The SEC Approve Bitcoin ETF Applications? Former Chair Hints It Should BlackRock, Fidelity, Other Spot Bitcoin ETF Applicants To Meet With The SEC REGISTER FOR FREE to continue reading ✔️ Unlock the full content of International Business Times UK for free offer available for a limited time only ✔️ Easily manage your Newsletters subscriptions and save your favourite articles ✔️ No payment method required Already have an account? Log in © Copyright IBTimes 2023. All rights reserved. Join the Discussion MOST READ IN Crypto 1 Binance Lays Off 1,000 Employees, Could Cut Thousands More Jobs Amid DOJ Probe: Reports 2 Ripple CEO Says SEC 'Sowed Confusion In The Market,' Regulator's Appeal Could Take 'Years' 3 SEC Throws Shade On Coinbase Compliance As Judge Seemingly Aligns With CEX 4 Crypto Will 'Transcend' US Dollar, Other Traditional Currencies, BlackRock CEO Predicts 5 Bitcoin To Reach New Heights But Will See Downturn First, Says Top Crypto Trader NEWS Business Technology World National Politics Media & Culture Opinion Sports Crypto Featured Social Capital Glossary SMB Forum Spotlight ABOUT About Us Contact us Advertise with us Terms & Conditions Privacy Policy Cookie Policy Editions United States Australia Brazil Colombia France Germany Indonesia India International Italy Japan Editions Nigeria Philippines Singapore South Africa South Korea Spain Mexico Taiwan United Arab Emirates United Kingdom FOLLOW US Facebook Twitter LinkedIn Newsletter © Copyright 2023 IBTimes LLC. All Rights Reserved.",
            "pubDate": "2023-07-17 16:47:29",
            "image_url": null,
            "source_id": "ibtimes",
            "category": [
                "top"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk Says Universe May Be Twice as Old as We Think, Dark Matter Seems \"Sketch\"",
            "link": "https://futurism.com/elon-musks-universe-twice-as-old-dark-matter",
            "keywords": [
                "Off World",
                "dark matter",
                "elon musk",
                "joe rogan"
            ],
            "creator": [
                "Victor Tangermann"
            ],
            "video_url": null,
            "description": "Elon Shrugged Elon Musk, the omnipotent ruler of the Twitterverse, has chimed in and has decreed that the universe is \"possibly\" twice as old as we think it is. Make of that what you will. Musk was responding to noted misinformation peddler and comedian Joe Rogan, who linked to a press release about a controversial […]",
            "content": "Elon Musk, the omnipotent ruler of the Twitterverse, has chimed in and has decreed that the actual physical universe is \"possibly\" twice as old as we think it is. Make of that what you will. Musk was responding to noted misinformation peddler and comedian Joe Rogan, who linked to a press release about a controversial new paper that indeed suggests the universe could be 26.7 billion years old, almost twice as the general consensus among scientists. The irreverent tech CEO also chimed in on another topic that's arguably far outside of his wheelhouse, concluding that \"dark matter is what seems most sketch to me.\" The research Rogan was alluding to suggests that an almost 100-year-old theory by Swiss astronomer Fritz Zwicky about light losing energy over billions of light-years may have been partially correct. In a recent paper published in the journal Monthly Notices of the Royal Astronomical Society, University of Ottawa astronomer Rajendra Gupta took Zwicky's theory and coupled them with existing theories surrounding the expansion of the universe. He also introduced new cosmological constants that could explain the laws that govern particle interactions. As a result, according to Gupta's calculations, the universe could be much older than generally thought. Zwicky, as it so happens, was also one of the earliest astrophysicists to suggest the existence of unseen mass he called \"dark matter\" after coming up with his tired light theory, a hypothetical form of unseen matter that is thought to make up much of the total universe. Dark matter is still generally accepted by the broader scientific community. While Musk was more open-minded about Gupta's theory, invisible matter that makes up most of the universe was clearly a step too far. Fortunately, the CEO had some well-meaning experts help him clear up his confusion surrounding \"sketch\" dark matter. \"Hi, I'm a dark matter physicist!\" cosmologist Sophia Gad-Nasr chimed in. \"We have lots of evidence for dark matter. A big one is the Cosmic Microwave Background, which has dark matter encoded into it.\" \"It is also necessary to explain the large scale structure we see in the Universe because there needs to be a type of matter that could clump together and form seeds early enough for the galaxies we see today, which regular matter couldn't do because of radiation pressure,\" she added. Gad-Nasr called Gupta's eyebrow-raising theory that the universe is actually twice as old \"far less plausible\" since it \"challenges very well-established theories\" and would \"require a lot of evidence to back it.\" In short, we're glad we've got experts like Gad-Nasr are still sticking around on Twitter. Otherwise, we'd risk people actually taking Musk and Rogan by their word — and that's rarely ever a good idea. But, to be fair, there's still a chance that Musk may end up to be rightfully skeptical. After all, \"our current picture of physics is certainly incomplete,\" as the cosmologist admitted in a follow-up. \"That's what makes the field so exciting.\" More on the research: Scientist Claims Universe Is Twice as Old as We Thought The post Elon Musk Says Universe May Be Twice as Old as We Think, Dark Matter Seems \"Sketch\" appeared first on Futurism.",
            "pubDate": "2023-07-17 16:11:26",
            "image_url": null,
            "source_id": "futurism",
            "category": [
                "science"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Twitter Employees In Africa Reportedly \"Ghosted\" After Elon Musk Fired Them",
            "link": "https://www.ndtv.com/world-news/twitter-employees-in-africa-reportedly-ghosted-after-elon-musk-fired-them-4216075#publisher=newsstand",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Terminated workers from Twitter's office in Accra, Ghana, have still not received severance pay despite being laid off seven months ago.",
            "content": "\"They literally ghosted us,\" one former Twitter Africa employee said Former staff of Twitter Africe who were fired claim that the company \"ghosted\" them. The former workers said that they have not received their promised severance pay, CNN reported on Monday. Billionaire Elon Musk acquired Twitter in October 2022 and began a series of layoffs which affected thousands of workers. In November, the company laid off almost all of its staff in Ghana, its only African location, days after its physical office opened following a year of remote working, the media outlet reported. Terminated workers from Twitter's office in Accra, Ghana, have still not received severance pay despite being laid off seven months ago. According to CNN, the former employees accepted Twitter's offer to pay them three months' worth of severance, the cost of repatriating foreign staff and legal expenses incurred during negotiations with the company, but they have not received the money or any further communication. \"They literally ghosted us,\" one former Twitter Africa employee told CNN. \"Although Twitter has eventually settled former staff in other locations, Africa staff have still been left in the lurch despite us eventually agreeing to specific negotiated terms.\" Adding that they agreed to the severance package without benefits, even though it was less than what colleagues elsewhere received. \"Twitter was non-responsive until we agreed to the three months because we were all so stressed and exhausted and tired of the uncertainty, reluctant to take on the extra burdens of a court case so we felt we had no choice but to settle,\" another former employee told CNN, who spoke anonymously due to having signed non-disclosure agreements. Promoted Listen to the latest songs, only on JioSaavn.com Carla Olympio, an attorney representing the former employees, told CNN that the last communication from Twitter was in May, shortly after the settlement was agreed. A spokesperson for Ghana's Ministry of Employment and Labor Relations told CNN it is investigating the claims.",
            "pubDate": "2023-07-17 15:35:00",
            "image_url": null,
            "source_id": "ndtv",
            "category": [
                "top"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk's New Tweet Gets Unexpected 'Bitcoin Response' From Michael Saylor: Details",
            "link": "https://u.today/elon-musks-new-tweet-gets-unexpected-bitcoin-response-from-michael-saylor-details",
            "keywords": [
                "News"
            ],
            "creator": null,
            "video_url": null,
            "description": "Recent tweet of Elon Musk caught attention of major Bitcoin evangelist Michael Saylor, here's what his response was",
            "content": "Contents \"Relationship\" between Musk and Bitcoin Bitcoin hitting all-time high thanks to Musk Elon Musk has posted a tweet about Twitter accepting, it seems, various forms of criticism regarding it — except one. He stated that \"whatever sins this platform may have, being boring is not one of them.\" Bitcoin advocate, head and founder of MicroStrategy Michael Saylor tweeted in response that \"Bitcoin is never Boring.\" #Bitcoin is never Boring. — Michael Saylor⚡️ (@saylor) July 17, 2023 \"Relationship\" between Musk and Bitcoin Elon Musk's tweets often attract the attention of various crypto enthusiasts because it is a good chance to make themselves visible to the masses of people who read Musk's tweets. The total count of Elon Musk 's followers on Twitter stands at a whopping 148.3 million. Musk is a well-known fan of the original meme coin DOGE and one of the largest holders of it. However, according to his earlier tweets, he also holds Bitcoin and some Ethereum. In early 2021, Tesla, which is spearheaded by the tech innovator, put $1.5 billion worth of Bitcoin on its balance sheet. Also, he announced that Tesla would be accepting BTC for its e-cars. However, later on, after a month or so, the company stopped selling cars for Bitcoin over environmental concerns related to proof-of-work mining. Ads Ads Related 'Rich Dad Poor Dad' Author Expects Stock Market to Collapse, Sees Depression Coming Bitcoin hitting all-time high thanks to Musk Over the next two years, the company sold its Bitcoin holdings and never resumed accepting BTC, despite Musk's statement that it would be done once BTC mining becomes at least 50% based on green energy technologies. This level was reached, according to Michael Saylor, back in 2021. Also, thanks to Tesla, Bitcoin reached a new all-time high in April of that year but then surpassed it in October, reaching almost $69,000 per Bitcoin. In the meantime, MicroStrategy continues to add Bitcoin to its balance sheet with the intention of long-term holding. As reported by U.Today, three weeks ago, the company purchased another stash of 12,333 BTC. It cost the company approximately $347 million. As of June 27, the company owns 152,333 BTC that it bought for roughly $4.52 billion.",
            "pubDate": "2023-07-17 15:30:00",
            "image_url": "https://u.today/sites/default/files/styles/736x/public/2023-07/37264.jpg",
            "source_id": "utoday",
            "category": [
                "top"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Twitter Employees In Africa Reportedly \"Ghosted\" After Elon Musk Fired Them",
            "link": "https://www.ndtv.com/world-news/twitter-employees-in-africa-reportedly-ghosted-after-elon-musk-fired-them-4216075",
            "keywords": [
                "World"
            ],
            "creator": null,
            "video_url": null,
            "description": "Terminated workers from Twitter's office in Accra, Ghana, have still not received severance pay despite being laid off seven months ago.",
            "content": "\"They literally ghosted us,\" one former Twitter Africa employee said Former staff of Twitter Africe who were fired claim that the company \"ghosted\" them. The former workers said that they have not received their promised severance pay, CNN reported on Monday. Billionaire Elon Musk acquired Twitter in October 2022 and began a series of layoffs which affected thousands of workers. In November, the company laid off almost all of its staff in Ghana, its only African location, days after its physical office opened following a year of remote working, the media outlet reported. Terminated workers from Twitter's office in Accra, Ghana, have still not received severance pay despite being laid off seven months ago. According to CNN, the former employees accepted Twitter's offer to pay them three months' worth of severance, the cost of repatriating foreign staff and legal expenses incurred during negotiations with the company, but they have not received the money or any further communication. \"They literally ghosted us,\" one former Twitter Africa employee told CNN. \"Although Twitter has eventually settled former staff in other locations, Africa staff have still been left in the lurch despite us eventually agreeing to specific negotiated terms.\" Adding that they agreed to the severance package without benefits, even though it was less than what colleagues elsewhere received. \"Twitter was non-responsive until we agreed to the three months because we were all so stressed and exhausted and tired of the uncertainty, reluctant to take on the extra burdens of a court case so we felt we had no choice but to settle,\" another former employee told CNN, who spoke anonymously due to having signed non-disclosure agreements. Promoted Listen to the latest songs, only on JioSaavn.com Carla Olympio, an attorney representing the former employees, told CNN that the last communication from Twitter was in May, shortly after the settlement was agreed. A spokesperson for Ghana's Ministry of Employment and Labor Relations told CNN it is investigating the claims.",
            "pubDate": "2023-07-17 14:55:28",
            "image_url": "https://c.ndtvimg.com/2023-07/pqhfqr2o_elon-musk-twitter_120x90_03_July_23.jpg",
            "source_id": "ndtv",
            "category": [
                "top"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk says Twitter ad revenue has halved since his takeover",
            "link": "https://nationalpost.com/news/world/elon-musk-twitter-ad-revenue-has-halved-since-takeover",
            "keywords": null,
            "creator": [
                "The Telegraph"
            ],
            "video_url": null,
            "description": "'Need to reach positive cash flow before we have the luxury of anything else'",
            "content": "Elon Musk has admitted Twitter has lost nearly half its advertising revenue since he bought the social network for US$44bn last year. The billionaire Tesla and SpaceX chief executive said Twitter was still in negative cash flow as he fights to turn the business around since his takeover. In tweets posted overnight, Musk also admitted that advertising revenue did not provide the increase “expected in June” although July has been “a bit more promising”. It comes as Twitter faces fresh competition from the new app Threads launched by Mr Musk’s rival Mark Zuckerberg. The Meta-owned platform, which is linked to Instagram, already claims to have amassed more than 100m users within weeks, putting it nearly halfway toward Twitter’s reported 250m users. Musk said: “We’re still negative cash flow, due to ~50pc drop in advertising revenue plus heavy debt load. “Need to reach positive cash flow before we have the luxury of anything else.” The billionaire entrepreneur has threatened to sue Meta after accusing the company of hiring “dozens” of former Twitter employees and assigning them to develop its “copycat” Threads app. Zuckerberg has accused Musk’s Twitter of missing its chance to create a social network with mass appeal as he said his newly-launched rival was aiming for more than a billion users. Twitter, founded in 2006, has often been accused of failing to capitalize on its cultural influence. It has attracted controversy under Musk’s ownership, with many users leaving it for upstart challengers such as Mastodon and Bluesky. Meta’s Threads, which allows people to instantly get started by following people they are friends with on Instagram, represents the biggest challenge to Twitter to date. Twitter had 237.8m daily users a year ago, the last time it reported figures before Mr Musk’s takeover.",
            "pubDate": "2023-07-17 14:20:28",
            "image_url": null,
            "source_id": "nationalpost",
            "category": [
                "top"
            ],
            "country": [
                "canada"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk says Twitter's cash flow still negative as ad revenue drops 50%",
            "link": "https://koreatimes.co.kr/www/nation/2023/07/501_355108.html?utm_source=fl",
            "keywords": null,
            "creator": [
                "webmaster@koreatimes.co.kr(KoreaTimes)"
            ],
            "video_url": null,
            "description": "Twitter's cash flow remains negative because of a nearly 50 percent drop in advertising revenue and a heavy debt load, Elon Musk said on Saturday, falling short of his expectation in March that Twitter could reach cash flow positive by June.",
            "content": "SpaceX, Twitter and electric car maker Tesla CEO Elon Musk looks on as he speaks during his visit at the Vivatech technology startups and innovation fair at the Porte de Versailles exhibition center in Paris, June 16. AFP-Yonhap Twitter's cash flow remains negative because of a nearly 50 percent drop in advertising revenue and a heavy debt load, Elon Musk said on Saturday, falling short of his expectation in March that Twitter could reach cash flow positive by June. \"Need to reach positive cash flow before we have the luxury of anything else,\" Musk said in a tweet replying to suggestions on recapitalization. Musk said on Sunday in another tweet that Twitter did not see the increase in advertising revenue that had been expected in June, adding, \"July is a bit more promising.\" Twitter Spaces also hasn't generated revenue yet and is \"all-cost\", Musk said. The Twitter logo is seen on a cell phone in Boston, Oct. 14, 2022. AP-Yonhap This is the latest sign that the aggressive cost-cutting measures since Musk acquired Twitter in October alone are not enough to get Twitter to cash flow positive, and suggests Twitter's ad revenue may have not recovered as fast as Musk suggested in an interview in April with the BBC that most advertisers had returned to the site. After laying off thousands of employees and cutting cloud service bills, Musk had said the company reduced its non-debt expenditures to $1.5 billion from a projected $4.5 billion in 2023. Twitter also faces annual interest payments of about $1.5 billion as a result of the debt it took on in the $44 billion deal that turned the company private. It is unclear what time frame Musk was referring to by the 50 percent drop in ad revenue. He has said Twitter was on track to post $3 billion in revenue in 2023, down from $5.1 billion in 2021. Twitter has been criticized over lax content moderation, followed by an exodus of many advertisers who did not want their ads appearing next to inappropriate content. Musk's hiring of Linda Yaccarino, former ad chief at Comcast's NBC Universal as CEO, signaled that ad sales are a priority for Twitter even as it works to increase subscription revenue. Yaccarino started working at Twitter in early June and has told investors Twitter plans to focus on video, creator and commerce partnerships and is in early talks with political and entertainment figures, payments services, and news and media publishers. On Thursday, Twitter said that select content creators will be eligible to get a part of the ad revenue the company earns in an attempt to draw more content creators to the site. (Reuters)",
            "pubDate": "2023-07-17 14:05:05",
            "image_url": "http://img.koreatimes.co.kr/upload/thumbnailV2/89e5d41f4b40481a8e5545427a37a469.jpg",
            "source_id": "koreatimes",
            "category": [
                "top"
            ],
            "country": [
                "south korea"
            ],
            "language": "english"
        }
    ],
    "nextPage": "1689602705aa2ef296a3463c1adeeee5f3fc19da7c"
}