{
    "status": "success",
    "totalResults": 97,
    "results": [
        {
            "title": "Elon Musk’s xAI Comes Out As ChatGPT New Competitor, Alex The Doge (ALEX) Is Bringing In The Investors",
            "link": "https://cryptomode.com/elon-musks-xai-comes-out-as-chatgpt-new-competitor-alex-the-doge-alex-is-bringing-in-the-investors/",
            "keywords": [
                "Altcoins",
                "Alex The Doge",
                "ChatGPT",
                "xAI"
            ],
            "creator": [
                "Robbie Kenllis"
            ],
            "video_url": null,
            "description": "The world of gaming is evolving, and blockchain technology is at the forefront of this transformation. Alex The Doge (ALEX) is a new player in the game, aiming to revolutionize the Play-to-Earn (P2E) gaming industry. With its innovative concept and focus on decentralized finance (De-Fi), Alex The Doge (ALEX) is poised to become a game-changer […] The post Elon Musk’s xAI Comes Out As ChatGPT New Competitor, Alex The Doge (ALEX) Is Bringing In The Investors appeared first on CryptoMode.",
            "content": "The world of gaming is evolving, and blockchain technology is at the forefront of this transformation. Alex The Doge (ALEX) is a new player in the game, aiming to revolutionize the Play-to-Earn (P2E) gaming industry. With its innovative concept and focus on decentralized finance (De-Fi), Alex The Doge (ALEX) is poised to become a game-changer in the gaming world. >>>>BUY $ALEX PRESALE NOW<<<< Introduction to Alex The Doge Alex The Doge (ALEX) is a P2E gaming platform built on Polygon’s blockchain for scalability, speed, and security. The platform allows community members to participate in gaming challenges and earn tokens with monetary value outside the ecosystem. The ALEX token and non-fungible tokens (NFTs) represent in-game assets and user-owned economies, respectively. The platform is built to enable self-custody, De-Fi, digital identification, NFTs, and cross-chain compatibility. >>>>BUY $ALEX PRESALE NOW<<<< Alex The Doge and De-Fi Alex The Doge (ALEX) has integrated De-Fi into its ecosystem, allowing users to interact peer-to-peer and transfer value throughout the ecosystem. Users can earn rewards in ALEX tokens, which can be staked for rewards and swapped for alternative assets on the platform. The platform offers liquidity provision on decentralized exchanges (DEXs). By providing liquidity on DEXs, users can trade Alex The Doge (ALEX) tokens for other cryptocurrencies. >>>>BUY $ALEX PRESALE NOW<<<< The MiracleVerse The MiracleVerse is a digital gaming world for the Alex The Doge (ALEX) community to utilize the ecosystem for P2E gaming rewards, De-Fi, and social trading. The platform aims to unite communities via cross-chain compatibility and integrate popular gaming services into its platform to improve interoperability in gaming. It prioritizes the ALEX token as the lifeblood of the ecosystem, ensuring its fungibility and interoperability. >>>>BUY $ALEX PRESALE NOW<<<< Alex The Doge and Elon Musk’s xAI Elon Musk is reportedly seeking to develop a competitor to OpenAI’s ChatGPT, and he has been approaching researchers about forming a new research lab. The Tesla CEO has been enlisting former DeepMind senior researcher Igor Babuschkin to head up the project, who has previously worked at OpenAI. Alex The Doge (ALEX) aims to bring in investors alongside Elon Musk’s xAI, the new ChatGPT competitor, by providing a social-fi interoperability with its gaming and trading platform. The platform is set to improve the social trading experience for users apart from multiple communities. >>>>BUY $ALEX PRESALE NOW<<<< Conclusion Alex The Doge (ALEX) is a revolutionary P2E gaming platform that offers users the opportunity to earn tokens with monetary value outside the ecosystem. The platform has integrated De-Fi into its ecosystem, allowing users to interact peer-to-peer and transfer value throughout the ecosystem. Its focus on the ALEX token and NFTs ensures its fungibility and interoperability. The platform aims to unite communities via cross-chain compatibility and improve interoperability in gaming. By providing social-fi interoperability with its gaming and trading platform, Alex The Doge aims to bring in investors alongside Elon Musk’s xAI, the new ChatGPT competitor. The presale is currently live, and users can acquire Alex The Doge (ALEX) tokens by creating an account and following the payment process. For more information about Alex The Doge (ALEX) presale use the links down below: None of the information on this website is investment or financial advice. CryptoMode is not responsible for any financial losses sustained by acting on information provided on this website.",
            "pubDate": "2023-07-17 13:05:06",
            "image_url": null,
            "source_id": "cryptomode",
            "category": [
                "top"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "News24.com | Elon Musk says Twitter cash flow still negative",
            "link": "https://www.news24.com/news24/Tech-and-Trends/elon-musk-says-twitter-cash-flow-still-negative-20230717",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Twitter owner Elon Musk said the company still has a negative cash flow because of its heavy debt load and a roughly 50% drop in advertising revenue.",
            "content": "Twitter owner Elon Musk said the company still has a negative cash flow because of its heavy debt load and a roughly 50% drop in advertising revenue. The social media site will “need to reach positive cash flow before we have the luxury of anything else,” Musk said in a tweet. Separately, the billionaire announced late Saturday the platform will increase the number of tweets verified accounts can see each day by 50%, following complaints from users. Several top advertisers paused spending on the platform after Musk acquired the company last year over concerns about changes the billionaire could make. Earlier this year, Musk said that many of the advertisers who fled had returned, and that becoming cash-flow positive was imminent. “Almost all of them have either come back or said they’re coming back,” Musk said in a Twitter Spaces in April. Advertiser spending dropped 89% to $7.6 million over a two-month period early this year, according to estimates for market research firm Sensor Tower. The top 10 advertisers had spent $71 million on ads from September to October of 2022, ahead of Musk’s acquisition. Meta Platforms’ Mark Zuckerberg released his own Twitter competitor this month, Threads, which rapidly reached 100 million users in the days after its launch. Some lawmakers have transitioned over to the alternative platform, but are still wary about committing to it. Days before the launch of Threads, Twitter sparked a backlash from users after the site imposed a temporary cap on the number of tweets that accounts can see each day. The limit had initially been set at 600 of unverified users, and 6 000 for verified accounts, before eventually being lifted to 1 000 and 10 000, respectively. The latest increase suggest verified users will now be able to see 15 000 posts, though Musk didn’t specify. Musk purchased the social media company for $44 billion in late October 2022. He has since made several changes to the product and company structure, many of which he attributes to decreasing the company’s cash burn and debt burden. The firm laid off thousands of employees in the wake of the deal. Among other changes, Musk introduced Twitter Blue, which allows users to verify their identity for $8 per month, and debuted ways for users to monetize their content.",
            "pubDate": "2023-07-17 13:03:57",
            "image_url": "https://scripts.24.co.za/img/sites/news24.png",
            "source_id": "news24",
            "category": [
                "technology"
            ],
            "country": [
                "south africa"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk Confirms Twitter’s Negative Cash Flow amidst 50% Plunge in Ad Revenue",
            "link": "https://www.coinspeaker.com/elon-musk-twitter-negative-cash-flow/",
            "keywords": [
                "Bitcoin News",
                "News",
                "Social Media",
                "Technology News",
                "elon musk",
                "spacex",
                "tesla",
                "twitter"
            ],
            "creator": [
                "Chimamanda U. Martha"
            ],
            "video_url": null,
            "description": "Coinspeaker Elon Musk Confirms Twitter’s Negative Cash Flow amidst 50% Plunge in Ad Revenue Insufficient earnings on Twitter suggest that the platform's advertising revenue may not have rebounded as quickly as previously anticipated. Elon Musk Confirms Twitter’s Negative Cash Flow amidst 50% Plunge in Ad Revenue",
            "content": ", the CEO of and SpaceX, who also holds the position of CTO at Twitter, recently revealed the social media platform’s ongoing negative cash flow and the weight of its debt burden. Musk cited a 50% drop in advertising revenue and a significant debt burden as the reasons behind Twitter’s ongoing cash flow challenges. Responding to a tweet about potential recapitalization options, the billionaire entrepreneur emphasized the need for Twitter to achieve positive cash flow before pursuing other endeavors. He further revealed that the popular social media platform he acquired for $44 billion did not witness the expected increase in advertising revenue in June but expressed some optimism for July. Musk also said that July showed more promise in advertising revenue while acknowledging that Twitter Spaces and the audio chat feature are currently generating costs without bringing revenue to the company. The new development highlights the ongoing struggle to achieve positive cash flow at , despite aggressive cost-cutting measures implemented since Musk’s acquisition of the company in October. Twitter Faces Annual Interest Payments of $1.5 Billion Since taking over Twitter, the Tesla CEO has implemented significant changes, including staff reductions and adjustments to content moderation policies. The billionaire wasted no time implementing a substantial , cutting 75% of Twitter’s global employees following the deal’s completion. The move aimed to streamline operations and reduce costs. In addition to the workforce reduction, Musk revealed that Twitter has successfully slashed its projected non-debt expenditures from $4.5 billion to $1.5 billion for 2023. Moreover, the acquisition deal came with a substantial debt burden for Twitter. Due to the debt, the platform now faces annual interest payments of approximately $1.5 billion, adding further strain to its financial situation. A New York Times also disclosed that Musk failed to settle hundreds of thousands of dollars in outstanding bills owed to travel vendors. The company’s executives accumulated these expenses before the official acquisition in 2022. Despite the cost-cutting measures and workforce restructuring, Twitter continues to grapple with negative cash flow. The social media platform has faced challenges with advertisers reducing or halting their ad spending due to concerns relating to content moderation and uncertainty about Twitter’s future. Elon Musk Anticipates Twitter to Become Cash Flow Positive Insufficient earnings on Twitter suggest that the platform’s advertising revenue may not have rebounded as quickly as previously anticipated. In an interview with the BBC in April, Musk indicated that most advertisers had returned to the platform, and he expected Twitter to become cash flow positive within the second quarter. To address the issues of poor advertising revenue and other financial challenges at Twitter, Musk appointed a former NBCUniversal marketing executive, as Twitter’s new CEO. Yaccarino’s background in advertising is expected to prioritize the revitalization of Twitter’s ad business. As such, the new CEO has outlined plans to focus on video, creator, and commerce partnerships and has engaged in early discussions with various entities, including political and entertainment figures, payments services, and news and media publishers. Last week, Twitter announced a revenue-sharing program for selected content creators. However, some users expressed disappointment at the program’s limited scope, which is currently only available to Twitter Blue verified subscribers who meet certain criteria. The program distributes a portion of the ad revenue generated from ads placed in replies to tweets. Several influencers and creators, including controversial figures like Andrew Tate, have revealed that they received payments through this program.",
            "pubDate": "2023-07-17 12:31:27",
            "image_url": null,
            "source_id": "coinspeaker",
            "category": [
                "top"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk should focus on Tesla as EV rivals pounce, Investors say",
            "link": "https://tech.hindustantimes.com/tech/news/elon-musk-should-focus-on-tesla-as-ev-rivals-pounce-investors-say-71689593125779.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Tesla is facing growing pressure from rivals with profit margins at risk.",
            "content": "Rival automakers pouncing on booming demand for electric vehicles pose the biggest challenge for Tesla over the next two years just as Elon Musk appears distracted by his high-profile ventures, from social media and space travel to artificial intelligence . So say respondents to the latest Markets Live Pulse survey. Out of 630 global MLIV Pulse contributors, 54% flagged the heightened risk of industry competition while 26% picked the behavior and decisions of its mercurial chief as a key concern for Tesla shareholders. “Musk is just such an unpredictable person, that I would count it among one of the top risks for Tesla ,” Matthew Tuttle, chief executive officer of Tuttle Capital Management, said in an interview. As Tesla's profit margins shrink, some 67% of survey participants said the billionaire executive should focus more on the carmaker. Their warning comes in the wake of a seemingly improbable 128% rally for the shares this year, fueled by renewed investor appetite for the tech megacaps and Musk's prediction that the era of fully autonomous vehicles is nigh. Even though Tesla currently enjoys sizable lead over other companies, be it an established carmaker or a startup, a big part of its remarkably high market valuation rests on the assumption that it will be able to maintain this dominance in a future where EVs are more commonplace. Yet Tesla rivals are picking up the pace. Just earlier this month, China's BYD Co. set a sales record for the second quarter, and delivered 352,163 fully electric vehicles. It has gained ground on Tesla, which handed over 466,140 EVs to customers worldwide — also an all-time high. The counterargument goes that a slew of Tesla's rivals are still struggling with teething issues. For instance, Ford Motor Co.'s US EV sales fell in the second quarter, after it had to pause production early this year at the Mexican factory that builds the Mustang Mach-E. Despite that, analysts and investors warn that Tesla's current advantage can erode quickly as government policies like the US's Inflation Reduction Act encourage other automakers to embrace EVs. With competitors stepping up their game, Tesla's famously expensive shares — trading at 75 times forward earnings — leave little room for error. In comparison, GM trades at about 6 times of estimated profits and Ford at about 9 times. “Competition is the most important risk factor for Tesla longer term, and even mediocre execution for the crop of around 100 new EVs coming to market this year will put pressure on Tesla,” said Craig Irwin, analyst at Roth Capital Partners. “The current lead over competition is very real, but we need to understand how this shrinks.” Defending market share comes at a cost. Around 63% of the MLIV Pulse respondents expect Tesla to continue to lower prices in order to capture higher volumes. As a result, its hefty profit margin is already taking a hit. More cuts will likely leave the margins even thinner, and narrow the gap with other auto companies. The impact of all the recent price cuts on Tesla's profits will be clear this Wednesday when the company reports second-quarter results. The average profit estimate for the quarter has come down 29% from where they were six months ago. “Winning stocks grow revenue and margins. Both are necessary,” said Nicholas Colas of DataTrek Research. The “Musk-risk” embedded in Tesla shares came into a sharp focus last year when the billionaire engaged in a highly public bid for social-media platform Twitter, and sold off big chunks of Tesla stock to pay for the acquisition. The pressure from the sales and worries that Musk had become too distracted from running Tesla weighed heavily on the shares. Since then, Twitter's own value has dwindled as well. About 67% of the survey respondents said they don't expect Twitter will ever be worth as much as Musk paid for it.",
            "pubDate": "2023-07-17 12:04:14",
            "image_url": "https://images.hindustantimes.com/tech/img/2023/07/17/1600x900/Elon_Musk_1689595106022_1689595106473.jpg",
            "source_id": "hindustantimes_tech",
            "category": [
                "technology"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        },
        {
            "title": "Twitter loses half advertising revenue since Elon Musk takeover",
            "link": "https://thefrontierpost.com/twitter-loses-half-advertising-revenue-since-elon-musk-takeover/",
            "keywords": [
                "Technology"
            ],
            "creator": [
                "The Frontier Post"
            ],
            "video_url": null,
            "description": "Monitoring Desk NEW YORK: Twitter has lost almost half of its advertising revenue since it was bought by Tesla chief Elon Musk for $44 billion last October, its owner has revealed. He said the company had not seen the increase in sales that had been expected in June, but added that July was a “bit […]",
            "content": "Monitoring Desk NEW YORK: Twitter has lost almost half of its advertising revenue since it was bought by Tesla chief Elon Musk for $44 billion last October, its owner has revealed. He said the company had not seen the increase in sales that had been expected in June, but added that July was a “bit more promising”. Mr Musk sacked about half of Twitter’s 7,500 staff when he took over in 2022 in an effort to cut costs. Rival app Threads now has 150 million users, according to some estimates. Its in-built connection to Instagram automatically gives the Meta-designed platform access to a potential two billion users. Meanwhile, Twitter is struggling under a heavy debt load. Cash flow remains negative, Mr Musk said at the weekend, although the billionaire did not put a time frame on the 50% drop in ad revenue. In a tweet he said: “Need to reach positive cash flow before we have the luxury of anything else.” After laying off thousands of employees and cutting cloud service bills, Mr Musk said Twitter was on track to post $3 billion in revenue in 2023, down from $5.1bn in 2021. The development is the latest sign the aggressive cost-cutting measures have not been enough to ignite a return of advertisers who fled after changes to its content moderation rules. That is despite an interview Mr Musk gave to the BBC in April, in which he suggested that most had returned to the site. However, Meghana Dhar, the former head of partnerships at Snap and Meta, which owns the new Twitter rival Threads, said the company had been struggling prior to Mr Musk’s buyout. “Elon and Twitter are in a candidly tough position right now,” she told the BBC’s Today programme. “To be fair to Elon though, we’ve seen that decline in Twitter revenue and growth in revenue since pre-Elon – there’s been kind of a steady decline.” Lucy Coutts, investment director at JM Finn, said: “You wouldn’t bet against him, he’s a kind of mercurial figure and I think probably he will turn it around but it is just going to take longer. “But unfortunately he has got $13bn of debt to pay by the end of July so we may see more pressure on the shares in Tesla if he has to sell more of his stake in that company.” Mr Musk is also the chief executive and majority shareholder of electric car-maker Tesla, which will report its latest quarterly financial results on Wednesday. Linda Yaccarino, previously head of advertising at NBCUniversal, was taken on as chief executive of Twitter in June – a move suggesting advertising sales are still a priority for the company. Ms Yaccarino has said Twitter plans to focus on video, creator and commerce partnerships. It is said to be in early talks with political and entertainment figures, payments services, and news and media publishers.–BBC",
            "pubDate": "2023-07-17 11:56:13",
            "image_url": null,
            "source_id": "thefrontierpost",
            "category": [
                "technology"
            ],
            "country": [
                "pakistan"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk's New Tweet Triggers Explosive Dogecoin (DOGE) Pump",
            "link": "https://u.today/elon-musks-new-tweet-triggers-explosive-dogecoin-doge-pump",
            "keywords": [
                "News"
            ],
            "creator": null,
            "video_url": null,
            "description": "DOGE price explodes following new tweet from Tesla founder and current Twitter owner",
            "content": "In a sudden surge, the price of Dogecoin (DOGE) experienced a vertical rise of 3% today, shooting up from $0.07 to $0.073 per DOGE in just one minute. The catalyst behind this explosive price action? None other than Elon Musk , the enigmatic billionaire and notable figurehead of Tesla, SpaceX and Twitter. DOGE to USD by CoinMarketCap Renowned for his playful interactions with the crypto community, Musk responded to a question on Twitter about his preference for cats or dogs with a simple yet impactful answer: \"Doges.\" This seemingly innocuous response was enough to ignite a sharp pump in the price of the eponymous token. Doges — Elon Musk (@elonmusk) July 17, 2023 Almost instantaneously, large volumes of trades flooded the DOGE market, triggered by what seems to be automated buying bots meticulously programmed to seize any mention of Dogecoin by the self-proclaimed \"Dogefather\" himself, Elon Musk. Related DOGE Price Analysis for July 16 Ads Ads However, the pump proved to be short-lived. Merely a minute after the vertical candle appeared on the DOGE price chart, it deflated just as rapidly. Astonishingly, a mere three hours following the tweet, the price of Dogecoin plummeted by over 5% at one point, effectively eradicating the entire pump and leaving the token a couple of percentage points lower. Too simple This unexpected reversal of events may serve as a cautionary tale, suggesting that attempting to trade Dogecoin based on Musk's tweets or news is an exercise in futility. The patterns that emerge from such trades are all too predictable, making it increasingly likely that one would end up in the negative rather than profitably competing with lightning-fast trading bots, which effortlessly exploit such trends.",
            "pubDate": "2023-07-17 11:30:00",
            "image_url": "https://u.today/sites/default/files/styles/736x/public/2023-07/37245.jpg",
            "source_id": "utoday",
            "category": [
                "top"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Conor McGregor reacts to Mark Zuckerberg vs Elon Musk fight talk",
            "link": "https://www.independent.co.uk/sport/ufc/conor-mcgregor-zuckerberg-musk-fight-b2376531.html",
            "keywords": [
                "UFC",
                "Sport"
            ],
            "creator": [
                "Alex Pattle"
            ],
            "video_url": null,
            "description": "The tech titans have gone back and forth on social media over the possibility of squaring off in a cage fight",
            "content": "Conor McGregor has said he is ‘interested’ in the prospect of tech titans Mark Zuckerberg and Elon Musk going head to head in a cage fight. Zuckerberg is the CEO of Meta, while Musk owns Twitter and runs Tesla and SpaceX, and the pair have gone back and forth on social media recently, expressing a desire to fight one another. Boxing promoter Eddie Hearn and UFC president Dana White have both admitted that they would happily stage such a bout, and McGregor has now weighed in on the matter. “I‘m interested,” the Irishman told the Daily Mail . “Are they gonna go ahead with it? Are they gonna make it happen? If it happens under the UFC banner, I’m with it. It has to happen under the UFC banner.” The former dual-weight UFC champion said, however, that he would not train either man for the fight. “I’m training for my own fight,” McGregor insisted, referencing his planned bout with Michael Chandler, which is still without a date, location or weight class . “I’m feeling really good, really good. I’m ready to fight,” added McGregor, 35, while his manager Audie Attar said of the Chandler fight: “Listen, you can’t rule this year out, but we’re definitely gearing up for a strong match-up with Michael Chandler.” McGregor last fought in July 2021, when he suffered a broken leg in a loss to Dustin Poirier. It is believed that McGregor vs Chandler will not take place in 2023, because the Irishman is still absent from the United States Anti-Doping Agency’s testing pool. In order to compete, athletes must have been in the pool for six months while returning zero positive test results and at least two negatives. However, it was suggested earlier this year that an exception could be made for McGregor. Click here to subscribe to The Independent’s Sport YouTube channel for all the latest sports videos.",
            "pubDate": "2023-07-17 10:56:28",
            "image_url": "https://static.independent.co.uk/2023/07/17/11/newFile-1.jpg?width=1200&auto=webp",
            "source_id": "independentuk",
            "category": [
                "sports"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "Ex-Twitter executives say Elon Musk still owes them US$1.6mil for legal bills",
            "link": "https://www.thestar.com.my/tech/tech-news/2023/07/17/ex-twitter-executives-say-elon-musk-still-owes-themus16mil-forlegal-bills",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "A group of Twitter Inc’s former top executives say the struggling social-media platform owes them more than US$1.6mil for legal fees and they want a judge to force new owner Elon Musk to pay that tab now. Read full story",
            "content": "A group of Twitter Inc’s former top executives say the struggling social-media platform owes them more than US$1.6mil for legal fees and they want a judge to force new owner Elon Musk to pay that tab now. The group – led by ex-Twitter Chief Executive Officer Parag Agrawal – says the legal bills accrued in connection with lawsuits and government probes of the company’s activities while they ran it. The former executives claim Twitter is violating its own bylaws by refusing to cover the sums. They were ousted when Musk bought the company for US$44bil last year. \"Over the better part of the past year, plaintiffs have tried and failed to make Twitter honor its advancement obligations,” their lawyers said Wednesday in a court filing. \"Twitter invented evolving excuses for its non-payment of the full amounts owed.” Agrawal, along with former chief counsel Vijaya Gadde and Chief Financial Officer Ned Segal, are asking Delaware Chancery Court Chief Judge Kathaleen St. J. McCormick to order Twitter to cover the expenses without holding a trial. Twitter faces numerous suits alleging that the company under Musk’s leadership has failed to pay millions owed to former employees, vendors and landlords while purportedly trying to stay financially solvent. Musk’s X Corp. this month sued the law firm that led the court fight to make him complete his takeover of Twitter, saying it took advantage of the company while running up a US$90mil bill. The suit put some of the blame on \"lame duck” executives at the social media platform, including Gadde, who Musk says went on a legal \"spending spree” before he took control. Twitter didn’t specifically respond to a request for comment on the legal-fee dispute. Delaware law generally favors advancement of legal fees on behalf of current and former executives of companies who are sued over their duties as officers or directors of the firms. The company has paid about US$600,000 of what it owes, but has withheld US$1,158,427 in fees for lawyers’ work representing former top managers in a congressional inquiry into the influence of social media on US elections, which required Gadde to appear before the House Committee on Oversight and Reform, according to the filing. The company also has failed to reimburse the group for US$273,747 in fees tied with investigations by the US Department of Justice and the US Securities and Exchange Commission into Twitter’s practices, along with civil lawsuits, according to the filing. Musk also is refusing to cover US$237,261 in fees generated by efforts to get them to cover the other legal bills. Twitter also is facing several investor suits over the fallout from Musk’s purchase of the platform after his failed effort to scuttle the deal. Former employees have sued, too, claiming they were wrongfully denied promised stock grants after being laid off. – Bloomberg",
            "pubDate": "2023-07-17 09:00:00",
            "image_url": "https://apicms.thestar.com.my/uploads/images/2023/07/17/2181377.jpg",
            "source_id": "thestar_my",
            "category": [
                "technology"
            ],
            "country": [
                "malaysia"
            ],
            "language": "english"
        },
        {
            "title": "Twitter loses nearly half advertising revenue since Elon Musk takeover",
            "link": "https://saudigazette.com.sa/article/634269/BUSINESS/Twitter-loses-nearly-half-advertising-revenue-since-Elon-Musk-takeover?ref=rss&format=simple&link=link",
            "keywords": [
                "BUSINESS"
            ],
            "creator": null,
            "video_url": null,
            "description": "WASHINGTON — Twitter has lost almost half of its advertising revenue since it was bought by Elon Musk for $44bn (£33.6bn) last October, its owner has revealed.He said the company had not seen the increase",
            "content": "WASHINGTON — Twitter has lost almost half of its advertising revenue since it was bought by Elon Musk for $44bn (£33.6bn) last October, its owner has revealed. He said the company had not seen the increase in sales that had been expected in June, but added that July was a \"bit more promising\". Musk sacked about half of Twitter's 7,500 staff when he took over in 2022 in an effort to cut costs. Rival app Threads now has 150 million users, according to some estimates. Its in-built connection to Instagram automatically gives the Meta-designed platform access to a potential two billion users. Meanwhile, Twitter is struggling under a heavy debt load. Cash flow remains negative, Musk said at the weekend, although the billionaire did not put a time frame on the 50% drop in ad revenue. In a tweet he said: \"Need to reach positive cash flow before we have the luxury of anything else.\" After laying off thousands of employees and cutting cloud service bills, Musk said Twitter was on track to post $3bn (£2.29bn) in revenue in 2023, down from $5.1bn in 2021. The development is the latest sign the aggressive cost-cutting measures have not been enough to ignite a return of advertisers who fled after changes to its content moderation rules. That is despite an interview Musk gave to the BBC in April, in which he suggested that most had returned to the site. However, Meghana Dhar, the former head of partnerships at Snap and Meta, which owns the new Twitter rival Threads, said the company had been struggling prior to Musk's buyout. \"Elon and Twitter are in a candidly tough position right now,\" she told the BBC's Today program. \"To be fair to Elon though, we've seen that decline in Twitter revenue and growth in revenue since pre-Elon — there's been kind of a steady decline.\" Lucy Coutts, investment director at JM Finn, said: \"You wouldn't bet against him, he's a kind of mercurial figure and I think probably he will turn it around but it is just going to take longer. \"But unfortunately he has got $13bn of debt to pay by the end of July so we may see more pressure on the shares in Tesla if he has to sell more of his stake in that company.\" Musk is also the chief executive and majority shareholder of electric car maker Tesla, which will report its latest quarterly financial results on Wednesday. Linda Yaccarino, previously head of advertising at NBCUniversal, was taken on as chief executive of Twitter in June -- a move suggesting advertising sales are still a priority for the company. Ms Yaccarino has said Twitter plans to focus on video, creator and commerce partnerships. It is said to be in early talks with political and entertainment figures, payments services, and news and media publishers. — BBC < Previous Page Next Page >",
            "pubDate": "2023-07-17 08:55:00",
            "image_url": "https://saudigazette.com.sa/uploads/images/2023/07/17/2134398.jpg",
            "source_id": "saudigazette",
            "category": [
                "business"
            ],
            "country": [
                "saudi arabia"
            ],
            "language": "english"
        },
        {
            "title": "Tesla Most Wanted Car in the World: Elon Musk-Run Auto Company Tops List of Most-Searched Four-Wheeler Brand on Google, Finds Report",
            "link": "https://www.latestly.com/auto/tesla-most-wanted-car-in-the-world-elon-musk-run-auto-company-tops-list-of-most-searched-four-wheeler-brand-on-google-finds-report-5271384.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Auto Trader's report indicates that Tesla has secured the top position as the most desired car brand worldwide, based on global search data, highlighting its widespread popularity among consumers.",
            "content": "San Francisco, July 17: Elon Musk-run Tesla is the most wanted car brand in the world, a new report has shown. According to the UK-based firm Auto Trader, Tesla came out as the car brand people are looking to buy the most across the world, topping the tables as the most Googled car for sale in 39 countries. The report analysed global search data for over 200 car brands in over 180 countries, to find the cars the whole world wants to buy the most. According to the report, Tesla came first in the US (in 25 of the 50 states), as well as Canada, France, Spain, Germany, Australia, UAE and Scandinavia. Jeep was the second most searched car for sale, topping the charts in 27 countries, including Iceland, Mexico, Argentina, India, and the Philippines. Tesla Car Crash in US: Tesla Four-Wheeler on Autopilot Mode Loses Control, Crashes Into Stopped Truck in Pennsylvania. \"Anyone looking to sell a Jeep Wrangler won't be waiting too long, with nearly 4,500 online searches for 'second hand Jeep' made every month,\" the report said. Moreover, the report showed that BMW and Toyota were the third and fourth most searched car brands. BMW is the car brand people want to buy the most in 20 countries, including the UK, South Africa, Estonia and Jamaica, while Toyota is the car manufacturer being searched to buy the most in Namibia, Lithuania and Venezuela. Tesla Fires Over 30 Employees for Planning To Form a Union. Mercedes rounded off the top five car brands the world wants to buy the most, coming out on top in 11 countries, including Saudi Arabia, Malaysia and Puerto Rico. Two iconic supercar brands, Lamborghini and Ferrari, made the top 10 list of the cars that the world wants to buy the most. Ferrari is the most searched-for vehicle to buy in Italy, while Lamborghini is listed as the top choice in four North American countries -- Honduras, Cayman Islands, Montserrat and Dominica. (The above story first appeared on LatestLY on Jul 17, 2023 01:57 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).",
            "pubDate": "2023-07-17 08:33:04",
            "image_url": null,
            "source_id": "latestly",
            "category": [
                "technology"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        }
    ],
    "nextPage": "168958278453cf307af8ddfef071bf789bb0c820be"
}