{
    "status": "success",
    "totalResults": 97,
    "results": [
        {
            "title": "Twitter loses nearly half advertising revenue since Elon Musk takeover",
            "link": "https://www.standardmedia.co.ke/world/article/2001477400/twitter-loses-nearly-half-advertising-revenue-since-elon-musk-takeover",
            "keywords": null,
            "creator": [
                "Standard Digital"
            ],
            "video_url": null,
            "description": "In May, Musk hired a new CEO, Linda Yaccarino, an NBCUniversal executive with deep ties to the advertising industry.",
            "content": null,
            "pubDate": "2023-07-17 05:26:55",
            "image_url": null,
            "source_id": "standardmedia",
            "category": [
                "world"
            ],
            "country": [
                "kenya"
            ],
            "language": "english"
        },
        {
            "title": "Twitter informs influencers of high payments under Elon Musk’s revenue-sharing plan",
            "link": "https://startupreporter.in/twitter-informs-influencers-of-high-payments-under-elon-musks-revenue-sharing-plan/",
            "keywords": [
                "Latest News",
                "Startup News"
            ],
            "creator": [
                ""
            ],
            "video_url": null,
            "description": "In a move to share some of its ad revenues, Twitter has reportedly informed numerous Twitter influencers, including several right-wing personalities, to anticipate substantial payments in their Stripe accounts. The social media company has allegedly communicated to them that they could expect tens of thousands of dollars. Twitter Influencers Share Payment Amounts Prominent individuals such […] The post Twitter informs influencers of high payments under Elon Musk’s revenue-sharing plan appeared first on Startup Reporter.",
            "content": "In a move to share some of its ad revenues, Twitter has reportedly informed numerous Twitter influencers, including several right-wing personalities, to anticipate substantial payments in their Stripe accounts. The social media company has allegedly communicated to them that they could expect tens of thousands of dollars. Prominent individuals such as Billy Markus, the creator of Dogecoin with 2.1 million followers, disclosed receiving $37,050 from the program. Brian and Ed Krassenstein, well-known twin brothers on social media, stated that they were each receiving over $24,000. Ashley St. Claire, a writer for The Babylon Bee, shared a screenshot indicating a payment of $7,153, which she described as “insanely good.” Other influencers, including Andrew Tate, Ian Miles Cheong, Benny Johnson, Rogan O’Handley, and an anonymous account named End Wokeness, mentioned payments ranging from $7,036 to $20,419. Twitter introduced the revenue-sharing program on Thursday, emphasizing its commitment to enabling users to earn a living directly on the platform. The program grants creators a portion of the ad revenue generated through ads displayed in the replies to their posts. It initially targets a smaller group of users who have signed up for Elon Musk’s new subscription feature and are subscribed to Twitter Blue or Verified Organizations. In the last three months, eligible users must have generated at least five million total post impressions.We do not allow state-affiliated media outlets, parody accounts, and fan accounts. Payments cover ad revenue earned since February. Since Musk’s involvement with Twitter, he has implemented strategies to increase revenues and reduce costs, including charging users for blue verification checks, introducing a subscription service, and selling office furniture. The revenue-sharing program, although seemingly contrasting these goals, aligns with Musk’s plan to attract more creators to the platform. NNotably, Musk himself informed accounts connected to him, such as Jonas Lismont, Sawyer Merritt, and Jason Calacanis, of forthcoming payments. Twitter CEO Linda Yaccarino expressed enthusiasm for the program, tweeting, “It makes a lot of cents to create here!” after its announcement. Also read The Latest news: Twitter begins paying Indian creators Ads revenue share Shopify implements cost calculator to discourage pointless meetings The post Twitter informs influencers of high payments under Elon Musk’s revenue-sharing plan appeared first on StartupNews.fyi .",
            "pubDate": "2023-07-17 05:02:14",
            "image_url": null,
            "source_id": "startupreporter",
            "category": [
                "top"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk Taunts Mark Zuckerberg, Says Meta Founder and CEO Really Burning Midnight Oil",
            "link": "https://www.latestly.com/technology/elon-musk-taunts-mark-zuckerberg-says-meta-founder-and-ceo-really-burning-midnight-oil-5270836.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Threads already crossed 150 million user sign-ups. Tesla CEO on Sunday said that Zuckerberg doesn't seem to care about his new product. Earlier, in response to a tweet about Meta CEO's investment in the Metaverse, Musk said, \"Censorship pays them well.\"",
            "content": "San Francisco, July 17: Twitter-owner Elon Musk on Monday said that Meta Founder and CEO Mark Zuckerberg is \"really burning\" the \"midnight oil.\" When a user tweeted, \"BREAKING: After forgetting about his app for a week the CEO of that other app has finally made a post.\" Musk replied, \"He’s really burning the midnight oil lol.\" Meta launched Threads on July 5 for iOS and Android users in 100 countries, and it is among the top free apps on the App Store. Elon Musk-Mark Zuckerberg Fight Update: Much-Anticipated Showdown Between Tesla CEO and Meta Founder Could Still Happen in Jiu Jitsu Style. Threads already crossed 150 million user sign-ups. Tesla CEO on Sunday said that Zuckerberg doesn't seem to care about his new product. Earlier, in response to a tweet about Meta CEO's investment in the Metaverse, Musk said, \"Censorship pays them well.\" On the other hand, former Twitter CEO Jack Dorsey shared that Zuckerberg requested to follow him on Threads, and wrote, \"Too soon b.\" Meanwhile, in response to a user's tweet about low engagement on the platform, Musk said, \"We’re trying hard to stop bots and trolls on this platform, so that may be part of the reason.\" Elon Musk vs Mark Zuckerberg War of Words Escalates; Twitter Owner Proposes ‘Literal Dick-Measuring Contest’ With Meta Founder After Challenging Him To Cage Fight. When another user posted that Twitter will introduce \"Profile Viewers\" similar to LinkedIn which would allow users to see who visited their profiles in the last 24 hours. The Twitter-owner replied, \"Not happening\". \"If I follow an account & they keep posting about it, they will be unfollowed,\" he posted. (The above story first appeared on LatestLY on Jul 17, 2023 10:17 AM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com ).",
            "pubDate": "2023-07-17 04:47:13",
            "image_url": null,
            "source_id": "latestly",
            "category": [
                "technology"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        },
        {
            "title": "Twitter ad revenue drops by 50%, says Elon Musk",
            "link": "http://www.socialsamosa.com/2023/07/twitter-ad-revenue-drops-elon-musk/?utm_source=rss&utm_medium=rss&utm_campaign=twitter-ad-revenue-drops-elon-musk",
            "keywords": [
                "News",
                "Twitter",
                "50",
                "ad",
                "Elon",
                "Musk",
                "Revenue"
            ],
            "creator": [
                "Social Samosa"
            ],
            "video_url": null,
            "description": "Elon Musk says that Twitter is still under negative cash flow, with a decrease in the ad revenue generated being below 50% and heavy unpaid debts. Twitter ad revenue has seen a dip by 50%, said Elon Musk in a Tweet responding to a user. He further said that the negative cash flow would be an obstacle until any further plans for the evolution are strategized or executed. He gave the statement via a Tweet while in conversation with a user suggesting a cash flow generation strategy. On the other hand, Musk said that Twitter’s usage has gone up 3.5% week-over-week. In mid-June, Musk announced almost all of the advertisers who had either dropped out or paused their advertising had come back to Twitter. The new CEO of Twitter, being the ex-Chairman – Global Advertising & Partnerships at NBCUniversal was also expected to revive the microblogging company’s primary source of revenue generation. Also Read: Twitter blue creators above 5 Mn impressions to get a share of ad revenue Although according to a recent statement by Musk, the cash flow at Twitter is still negative with a heavy debt load and a 50% drop in advertising revenue. This would also affect the creator monetization offering based on ad revenue sharing for creators. Twitter recently announced that select content creators on the social media platform will be eligible to get a part of the advertising revenue the company earns. Meanwhile, the Twitter rival and clone of the microblogging site Threads has been on the rise, it has crossed 100 million sign-ups, and head of Instagram, Adam Mosseri has now announced that on day eight of Threads, growth, retention, and engagement are “all way ahead of where I expected us to be at this point.” Various financial publishers have also estimated that Threads will add 8 billion in revenue for Meta over the next two years. The post Twitter ad revenue drops by 50%, says Elon Musk first appeared on Social Samosa.",
            "content": "Elon Musk says that Twitter is still under negative cash flow, with a decrease in the ad revenue generated being below 50% and heavy unpaid debts. Twitter ad revenue has seen a dip by 50%, said Elon Musk in a Tweet responding to a user. He further said that the negative cash flow would be an obstacle until any further plans for the evolution are strategized or executed. He gave the statement via a Tweet while in conversation with a user suggesting a cash flow generation strategy. We’re still negative cash flow, due to ~50% drop in advertising revenue plus heavy debt load. Need to reach positive cash flow before we have the luxury of anything else. — Elon Musk (@elonmusk) July 15, 2023 On the other hand, Musk said that Twitter’s usage has gone up 3.5% week-over-week. Platform usage up 3.5% week over week pic.twitter.com/5wdyrzcyhy — Elon Musk (@elonmusk) July 14, 2023 In mid-June, Musk announced almost all of the advertisers who had either dropped out or paused their advertising had come back to Twitter. The new CEO of Twitter, being the ex-Chairman – Global Advertising & Partnerships at NBCUniversal was also expected to revive the microblogging company’s primary source of revenue generation. Also Read: Twitter blue creators above 5 Mn impressions to get a share of ad revenue Although according to a recent statement by Musk, the cash flow at Twitter is still negative with a heavy debt load and a 50% drop in advertising revenue. This would also affect the creator monetization offering based on ad revenue sharing for creators. Twitter recently announced that select content creators on the social media platform will be eligible to get a part of the advertising revenue the company earns. Meanwhile, the Twitter rival and clone of the microblogging site Threads has been on the rise, it has crossed 100 million sign-ups, and head of Instagram, Adam Mosseri has now announced that on day eight of Threads, growth, retention, and engagement are “all way ahead of where I expected us to be at this point.” Various financial publishers have also estimated that Threads will add 8 billion in revenue for Meta over the next two years. You may also like: Instagram revamps with detailed features – Color & Fade 9 quick tips on building a good social media content strategy Social Media News Round-Up: Instagram's shoppable ads, YouTube fashion & more Instagram to eliminate fake followers Facebook introduces new tools across its family of apps for businesses Twitter to stop mass actions on TweetDeck from 23rd March Comments",
            "pubDate": "2023-07-17 04:47:00",
            "image_url": null,
            "source_id": "socialsamosa",
            "category": [
                "top"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk's Dietitian Mom Weighs In On WHO's Aspartame-Cancer Link With Her Own Advice On Diet Sodas",
            "link": "https://www.benzinga.com/23/07/33242289/elon-musks-dietitian-mom-weighs-in-on-whos-aspartame-cancer-link-with-her-own-advice-on-diet-sodas",
            "keywords": [
                "Aspartame",
                "Diet Coke",
                "Elon Musk",
                "Maye Musk",
                "SODA",
                "sweetner",
                "Benzinga"
            ],
            "creator": null,
            "video_url": null,
            "description": "Send To MSN: 0 read more",
            "content": "In a recent tweet, Elon Mus k’s dietitian mother Maye Musk referenced a World Health Organization (WHO) statement noting “limited evidence” that aspartame, a key ingredient in Diet Coke , can cause cancer. What Happened: Mother Musk took to Twitter to share the WHO’s stance on aspartame, a common ingredient in diet sodas. “The WHO noted there's \"limited evidence\" that aspartame can cause cancer and listed the sweetener as a Class 2B carcinogen, which includes Asian pickled vegetables, gasoline engine exhaust fumes, lead and talc-based body powder,” she said Mother Musk’s tweet comes after her son’s earlier remarks over the weekend, saying that if aspartame caused cancer, he would have been “dead long ago” due to his consumption of Diet Coke. See Also: Elon Musk Threatens To Unfollow A Subscriber If ‘They Keep Posting About It’ Why It Matters: Last week, a WHO committee declared that aspartame, a widely used artificial sweetener in diet drinks and low-sugar foods, might be a potential carcinogen. The International Agency for Research on Cancer based its conclusion on limited evidence from three observational studies that linked the consumption of artificially sweetened beverages to an increase in cases of liver cancer. Meanwhile, another WHO committee held steady on its assessment of a safe level of aspartame consumption. The U.S. Food and Drug Administration (FDA) has criticized the global agency’s findings and maintained its stance that aspartame is safe. According to Statista, Diet Coke holds a market share of 8% in the U.S. as per 2021 data as one of the Coca-Cola Company’s leading brands. Diet Coke’s popularity remains high despite concerns over its impact on health. Other than Musk, former President Donald Trump is known for liking Diet Coke. Read Next: Lisa Marie Presley’s Autopsy Prompts Expert To Warn About ‘Miracle’ Weight Loss Drug Ozempic: ‘Nobody’s Talking About This’ Maye Musk photo by lev radin on Shutterstock Engineered by Benzinga Neuro , Edited by Navdeep Yadav The GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more.",
            "pubDate": "2023-07-17 04:10:11",
            "image_url": null,
            "source_id": "benzinga",
            "category": [
                "top"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Tesla's Cybertruck is just one late promise of many made by Elon Musk - Business Insider",
            "link": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vdGVzbGEtY3liZXJ0cnVjay1lbG9uLW11c2stdHdpdHRlci1kcml2ZXItYXNzaXN0YW5jZS1zeXN0ZW0tZ2lnYS10ZXhhcy0yMDIzLTfSAXFodHRwczovL3d3dy5idXNpbmVzc2luc2lkZXIuY29tL3Rlc2xhLWN5YmVydHJ1Y2stZWxvbi1tdXNrLXR3aXR0ZXItZHJpdmVyLWFzc2lzdGFuY2Utc3lzdGVtLWdpZ2EtdGV4YXMtMjAyMy03P2FtcA?oc=5",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Tesla's Cybertruck is just one late promise of many made by Elon Musk  Business InsiderTesla completes first Cybertruck after years of delays  Fox BusinessLeaked Tesla Cybertruck Photo Shows No Cutout For Midgate  InsideEVs Tesla announces first Cybertruck build ahead of Q2 earnings | World DNA  WIONDoes the Tesla Cybertruck Crash Test Really Mean It's Safe?  MotorBiscuitView Full Coverage on Google News",
            "content": null,
            "pubDate": "2023-07-17 03:57:00",
            "image_url": null,
            "source_id": "google",
            "category": [
                "business"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Scottish Government slashes spending on Twitter adverts following Elon Musk takeover",
            "link": "https://www.dailyrecord.co.uk/news/politics/scottish-government-slashes-spending-twitter-30477641",
            "keywords": [
                "News"
            ],
            "creator": [
                "reporters@dailyrecord.co.uk (Chris McCall)"
            ],
            "video_url": null,
            "description": "EXCLUSIVE: Twitter has faced a 50 per cent drop in advertising revenue following a string of controversial changes at the tech firm.",
            "content": "Elon Musk bought Twitter for $44 billion last year (Image: AFP via Getty Images) × Group 28 Get the latest Scottish politics news sent straight to your inbox with our daily newsletter Invalid email Something went wrong, please try again later. Sign Up No thanks, close We use your sign-up to provide content in the ways you've consented to and improve our understanding of you. This means that we may include adverts from us and third parties based on our knowledge of you. We also may change the frequency you receive our emails from us in order to keep you up to date and give you the best relevant information possible. As always you can unsubscribe at any time. More info × Group 28 Thank you for subscribing! We have more newsletters Show Me No thanks, close See our Privacy Notice The Scottish Government has slashed its advertising spending on Twitter following the takeover of the social media giant by Elon Musk. Online adverts are a key way for ministers to promote important policies such as public health campaigns. But the government has spent just £9,621 on advertising on Twitter so far this year - compared to £101,494 on YouTube and £349,548 on Meta , which owns Facebook and Instagram. A total of £377,704 was spent on Twitter ads last year, suggesting there has been a significant slow down in spending on the platform in recent months. Musk , the controversial owner of electric carmaker Tesla, bought control of the social media giant in October last year for a reported $44 billion. The billionaire has since slashed 75 per cent of the tech firm's employees including teams charged with tracking abuse and changed how the company verifies authentic accounts. Read More Related Articles Keir Starmer must be 'on the side of the people' as Labour leader branded 'fiscal conservative' Read More Related Articles Scots quangos bosses pocket £22m as NHS and local services struggle for funding Musk announced on Saturday that Twitter faces a negative cash flow as a result of a 50 per cent drop in advertising revenue. The platform also faces competition from Threads - a new social media offering from Meta that hopes to capitalise on Twitter's recent woes. Musk previously claimed most of the advertisers who left had returned and that the company might become cash-flow positive in the second quarter. Twitter recently hired Linda Yaccarino as its new CEO in an attempt to woo back companies who previously advertised with it. But the platform has upset some users by imposing new limits on how many tweets they can view in a day. Musk said the restrictions were needed to prevent unauthorised harvesting of potentially valuable data. Despite its recent issues Twitter remains a popular tool for Scottish politicians from all parties to share reactions to breaking news. Humza Yousaf has more than 217,000 followers and regularly posts several messages each day. But he lags behind the Twitter presence of Nicola Sturgeon, who amassed 1.5 million followers during her time in Bute House. Her daily covid briefings were also broadcast live on the platform during the height of the pandemic. The former SNP leader has cut back the number of tweets she posts since she resigned as first minister in February. Scottish politics Scots face council tax rise bombshell Free school meals roll-out delayed again Humza Yousaf IndyRef2 plan 'big risk' SNP MPs 'fleeing sinking ship' A spokesman for the Scottish Government said: \"Effective communication is an essential aspect of the Scottish Government’s work and is required to increase public awareness and encourage uptake of key government policies. \"Social media platforms provide the opportunity to target relevant messaging to particular audiences and are used where appropriate.\" To sign up to the Daily Record Politics newsletter, click here . READ NEXT Expert reveals weight loss drink that speeds up fat burning and aids immune system Exact date sunshine will return to Scotland as Met Office issues heatwave verdict People 'baffled' after finding out what crispy seaweed from the Chinese is made of Story Saved You can find this story in My Bookmarks. Or by navigating to the user icon in the top right. Follow Daily Record Facebook Twitter Comment More On Twitter Social media Scottish Government",
            "pubDate": "2023-07-17 03:30:00",
            "image_url": "https://i2-prod.mirror.co.uk/incoming/article30458810.ece/ALTERNATES/s615/1_FILES-US-TECH-AI-MUSK.jpg",
            "source_id": "dailyrecord",
            "category": [
                "top"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "Twitter lost half of its ad revenue, says Elon Musk",
            "link": "https://technology.inquirer.net/126047/twitter-lost-half-of-ad-revenue/",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Twitter owner Elon Musk said his social media company lost half of its advertising revenue. On July 15, 2023, he tweeted that statement, saying his business is still in a \"negative cash flow.\" Also, Insider intelligence reported Twitter was likely to earn less than $3 billion in 2023. Microsoft Start says Musk's latest changes discouraged users and advertisers. Twitter is among the most popular social media networks, affecting how millions interact daily. However, negative changes could lead to its rapid decline and shutdown. Hence, looking closely at this issue lets you know how a social network functions like most companies. These platforms boom or bust, depending on their leadershi...Keep on reading: Twitter lost half of its ad revenue, says Elon Musk",
            "content": "Twitter owner Elon Musk said his social media company lost half of its advertising revenue. On July 15, 2023, he tweeted that statement, saying his business is still in a “negative cash flow.” Also, Insider intelligence reported Twitter was likely to earn less than $3 billion in 2023. Microsoft Start says Musk’s latest changes discouraged users and advertisers. Twitter is among the most popular social media networks, affecting how millions interact daily. However, negative changes could lead to its rapid decline and shutdown. Hence, looking closely at this issue lets you know how a social network functions like most companies. These platforms boom or bust, depending on their leadership. Learn more about how social media companies run by reading this article. It will discuss the changes that may have led to the company’s dire financial situation. Later, I will cover the other issues it faces under its new CEO. We’re still negative cash flow, due to ~50% drop in advertising revenue plus heavy debt load. Need to reach positive cash flow before we have the luxury of anything else. — Elon Musk (@elonmusk) July 15, 2023 Elon Musk said, “We’re still negative cash flow due to ~50% drop in advertising revenue plus heavy debt load. Need to reach positive cash flow before we have the luxury of anything else.” Elon Musk implemented numerous changes shortly after acquiring Twitter. Unfortunately, most of his decisions have been discouraging advertisers and users. For example, he immediately reduced content moderation to fulfill his promise of turning Twitter into a “shared digital town square.” As a result, hate speech flooded the platform. Some people began impersonating major companies. For example, a prankster created a fake pharmaceutical firm Eli Lilly account. Then, the unknown person tweeted, “We are excited to announce insulin is free now.” Coincidentally, the company’s stock price fell by roughly 4.37%. Then, the tech billionaire over 80% of his workforce. Later, users complained about the site’s lagging performance. Eventually, Twitter began implementing monetization features. For example, Musk announced paying for verification icons and divided them into three colors. You can become a verified user by paying $8 monthly for the Twitter Blue program. Individuals receive blue checkmarks, politicians get silver, and companies receive gold. You may also like: Elon Musk proposes “d*ck measuring contest” with Mark Zuckerberg In early July, Chief Twit announced temporary reading limits for unverified, verified, and new unverified users. Here are the number of tweets each can read: The rules heavily incentivize people to pay for Twitter Blue to read more tweets. Yet, these money-making moves weren’t enough to raise the company from the red. In June, its Colorado office received an eviction notice after it failed to pay rent. The business owner admitted that his social media website is still struggling financially. Advertising revenue isn’t the only problem Twitter faces. The company has other issues that the new CEO, Linda Yaccarino , must resolve. Learn more about them below: You may also like: How to use Cash App Twitter owner Elon Musk said his company lost roughly 50% of its advertising revenue. Moreover, he said his social media platform has massive debts. It said it must earn more money before it has the “luxury of anything else.’ Consequently, the company might focus on its negative cash flow before implementing new strategies. Will the social media network get back on its feet and soar above its competitors? Get the latest tips and trends regarding social media, gadgets, and more at Inquirer Tech. Subscribe to our daily newsletter By providing an email address. I agree to the Terms of Use and acknowledge that I have read the Privacy Policy . Subscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000.",
            "pubDate": "2023-07-17 02:27:58",
            "image_url": "https://technology.inquirer.net/wp-content/blogs.dir/4/files/2023/07/twitter-lost-ad-revenue.png-620x349.jpg",
            "source_id": "inquirer",
            "category": [
                "top"
            ],
            "country": [
                "philippines"
            ],
            "language": "english"
        },
        {
            "title": "Elon Musk’s Brother, Kimbal Musk Journey to Get Rich",
            "link": "https://www.thecoinrepublic.com/2023/07/16/elon-musks-brother-kimbal-musk-journey-to-get-rich/",
            "keywords": [
                "Blog",
                "cryptocurrency",
                "Elon Musk’s Brother",
                "Kimbal Musk"
            ],
            "creator": [
                "Ritika Sharma"
            ],
            "video_url": null,
            "description": "1 Kimbal Musk, a South African restaurateur, and owner of The Kitchen Restaurant Group is the brother of Elon Musk. 2 He is considered among the wealthiest personalities to empower and invest in food entrepreneurs. Kimbal Musk, a philanthropist, chef, food entrepreneur, and restaurateur was born on 20 September 1972. He is the brother of Elon Musk, the Tesla founder, and took up several businesses together. He was born in Pretoria, South Africa, in a business-oriented family and completed his graduation in Business from Queen’s University. At the age of eighteen, he shifted to Canada from South Africa for business …",
            "content": "Elon Musk’s Brother, Kimbal Musk Journey to Get Rich Kimbal Musk, a philanthropist, chef, food entrepreneur, and restaurateur was born on 20 September 1972. He is the brother of Elon Musk, the Tesla founder, and took up several businesses together. He was born in Pretoria, South Africa, in a business-oriented family and completed his graduation in Business from Queen’s University. At the age of eighteen, he shifted to Canada from South Africa for business purposes. Kimbal Musk’s interest in food made him a Global Social Entrepreneur at the World Economic Forum. He is a successful entrepreneur on his own right now. Kimbal Musk’s net worth is estimated to be around $700 Million and made big financial growth alongside Elon Musk. He began his career at the age of eighteen in an entrepreneurial venture, where he was accountable for managing a business-in-a-box franchise named College Pro Painters. $15,000 was made to him in the first year and $35,000 in the second year and become the manager of the year. Later, Zip2, an online city guide was co-founded by Kimbal and Elon Musk in the year 1995. It was an online city guide offering web content for large-scale newspapers, acquired by Compaq for $307 Million in 1999. In partnership with Hugo Matheson, Kimbal Musk introduced The Kitchen Restaurant Group, based in Boulder, Colorado. The group was introduced in 2004 and is a world-class collection of restaurants based on warm and genuine hospitality services of the highest quality. Big Green, a nonprofit organization, formally known as The Kitchen Community, was founded by Musk and Matheson in 2011. The nonprofit organization involves learning gardens, serving in around 600 schools, and providing benefits to more than 300,000 children. The organization is operating in cities including Detroit, Chicago, Los Angeles, Indianapolis, Pittsburgh, and Memphis. Another company founded by Kimbal Musk is Square Roots, a farming company situated in Brooklyn. Tobias Peggs and Musk in partnership established the firm in 2016. The firm focuses on growing food and uses shipping containers with controlled microclimates to grow produce. Focusing on Kimbal Musk’s career, it is observed that investment in startups is a source of wealth and made him a big financial success. In 2020, Kimbal owned around 130,000 shares of Tesla stock and his stake grew to 572,000 when Tesla split 5:1. In January 2021, when Tesla reached $880, Kimbal’s Tesla equity reached $503 Million. Currently, the net worth of Kimbal Musk is around $700 Million. According to Kimbal, is a good idea on many levels with a promising future. However, he does not show positive sentiments towards the crypto market. His main concern is related to heavy energy consumption and the adverse impact of the same on the environment. Kimbal Musk is a food entrepreneur, chef, and philanthropist and owns The Kitchen Restaurant Group. Investment in the startup venture is one of Kimbal’s main sources of wealth and he is an early investor in Tesla Company. The perspective of Kimbal Musk on crypto is not very positive due to heavy energy consumption and adverse impact on the environment.",
            "pubDate": "2023-07-17 02:01:52",
            "image_url": null,
            "source_id": "thecoinrepublic",
            "category": [
                "top"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Has Mark Zuckerberg given up on Threads already? Elon Musk thinks so",
            "link": "https://www.orissapost.com/has-mark-zuckerberg-given-up-on-threads-already-elon-musk-thinks-so/",
            "keywords": [
                "Sci-Tech",
                "Elon Musk",
                "Mark Zuckerberg",
                "Threads",
                "Twitter"
            ],
            "creator": [
                "Post News Network"
            ],
            "video_url": null,
            "description": "San Francisco: Twitter-owner Elon Musk Sunday said that Meta Founder and CEO Mark Zuckerberg doesn’t seem to care about Threads. After a user tweeted a screenshot of the last Zuckerberg’s post on Threads and wrote, “It has now been 6 days since the CEO of that other app has made a post. Did he give […]",
            "content": "Has Mark Zuckerberg given up on Threads already? Elon Musk thinks so IANS Updated: July 17th, 2023, 07:20 IST in Sci-Tech 0 Photo courtesy: msnbc.com Share on Facebook Share on Twitter Share on WhatsApp Share on Linkedin San Francisco: Twitter-owner Elon Musk Sunday said that Meta Founder and CEO Mark Zuckerberg doesn’t seem to care about Threads. After a user tweeted a screenshot of the last Zuckerberg’s post on Threads and wrote, “It has now been 6 days since the CEO of that other app has made a post. Did he give up on it already?” Musk replied, “He doesn’t seem to care about his new product.” Meta launched Threads on July 5 for iOS and Android users in 100 countries, and it is among the top free apps on the App Store. Threads already crossed 150 million user sign-ups. Earlier, in response to a tweet about Zuckerberg’s investment in the Metaverse, Musk said, “Censorship pays them well.” Last month, Twitter-owner had posted, “Zuck my *tongue emoji*.” Back in 2017, Tesla CEO had hit back at Zuckerberg, saying that the Meta CEO’s understanding of artificial intelligence (AI) is ‘limited.’ Meanwhile, in response to a tweet, Musk said: “Length of quote posts as seen on timeline will be shortened significantly. You will still be able to click through and see the whole thing, but QT’s can’t take up an entire screen.” “Ads will also be shortened in vertical height. Cost of an ad will be proportionate to its size.” IANS Tags: Elon Musk Mark Zuckerberg Threads Twitter Share Tweet Send Share Suggest A Correction Enter your email to get our daily news in your inbox. Leave this field empty if you're human: Related Posts Google Play Store sees huge drop in apps amid tough policies July 17, 2023 Chandrayaan-3: ISRO successfully performs second orbit-raising manoeuvre of spacecraft July 17, 2023 Google introduces new media viewer for Chat on Android July 17, 2023 Apple iPhone 15 may come in pink colour July 17, 2023 Daily use on Meta Threads drops by 50% July 17, 2023 El Nino: Asia under floods as US, Europe face significant heatwave July 16, 2023 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ",
            "pubDate": "2023-07-17 01:50:47",
            "image_url": "https://i0.wp.com/www.orissapost.com/wp-content/uploads/2022/04/Elon-Musk-2.jpg?fit=300%2C150=1",
            "source_id": "orissapost",
            "category": [
                "science",
                "technology"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        }
    ],
    "nextPage": "16895586478e831a9ae99781e2cd298b6103b847e7"
}